Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: Size of the font used in the editor (int)
de: Schriftgröße des Editors (int)

source: Size of the font used in the shell (int)
de: Schriftgröße der Shell (int)

source: Size of the panel when floating (2-tuple of ints)
de: Größe des Panels, wenn schwebend. (2er-Tupel aus int)

source: Size of this field (int)
de: Länge des Feldes (int)

source: Sorry, there are no records to report on.
de: Keine Datensätze für Report vorhanden.

source: Sort Ascending
de: Aufsteigend sortieren

source: Sort Descending
de: Absteigend Sortieren

source: SortFunction must be callable
de: SortFunction muss aufrufbar sein

source: Spacing in pixels between buttons in the control (int)
de: Abstand zwischen den Knöpfen des Elements in Pixeln (int)

source: Specifies custom (overridden) SQL to use.
de: Spezifiziert massgeschneidertes (überschriebenes) SQL.

source: Specifies font object for this control. (dFont)
de: Schrift-Objekt für dieses Element. (dFont)

source: Specifies if the cell font is bold-faced. (bool)
de: Ist die Schrift dieser Zelle fett? (bool)

source: Specifies if the font is bold-faced. (bool)
de: Ist die Schrift fett? (bool)

source: Specifies if the header font is bold-faced. (bool)
de: Ist die Titel-Schrift fett? (bool)

source: Specifies if the node font is bold-faced. (bool)
de: Ist die Schrift dieses Knotens fett? (bool)

source: Specifies the Security Manager, if any. You must subclass dSecurityManager, overriding the appropriate hooks and properties, and then set dApp.SecurityManager to an instance of your subclass. There is no security manager by default - you explicitly set this to use Dabo security.
de: Spezifiziert den Security Manager, falls vorhanden. Muss von dSecurityManager abgeleitet sein und die entsprechenden Properties und Hooks definieren. Besetzen Sie dApp.SecurityManager mit einer instanz der abgeleiteten Klasse. Es ist kein Security Manager vorgegeben - Sie müssen dies explizit zuweisen.

source: Specifies the alignment of the text. Left : Checkbox to left of text (default) Right : Checkbox to right of text
de: Definiert die Ausrichtung des Textes (str) Left: Ankreuzfeld links vom Text (Standard) Right: Ankreuzfeld rechts vom Text

source: Specifies the alignment of the text. (str) Left (default) Center Right
de: Definiert die Ausrichtung des Textes (str) Left (Standard) Center Right

source: Specifies the alignment of the text. (str) Left (default) Center Right
de: Definiert die Ausrichtung des Textes (str) Left (Standard) Center Right

source: Specifies the application's home directory. (string) The HomeDirectory is the top-level directory for your application files, the directory where your main script lives. You never know what the current directory will be on a given system, but HomeDirectory will always get you to your files.
de: Spezifiziert das Heimatverzeichnis der Anwendung. (string) Das Heimatverzeichnis ist oberste Verzeichnis der Anwendungsdateien, das Verzeichnis, in dem sich das Startscript befindet. Auch wenn nicht bekannt ist wo sich das momentane Verzeichnis im System befindet, gelangt man immer über das Heimatverzeichnis zu den Dateien.

source: Specifies the background color of the object. (str, 3-tuple, or wx.Colour)
de: Hintergrundfarbe des Objektes. (str, 3-tuple oder wx.Colour)

source: Specifies the caption displayed in this column's header.
de: Beschriftung des Spaltenkopfes

source: Specifies the class to instantiate for the main form. Can be a class reference, or the path to a .cdxml file. Defaults to the dFormMain base class. Set to None if you don't want a main form, or set to your own main form class. Do this before calling dApp.start(), as in: >>> import dabo >>> app = dabo.dApp() >>> app.MainFormClass = MyMainFormClass >>> app.start() (dForm)
de: Spezifiziert die zu instanziierende Klasse der Hauptform. Dies kann eine Klassenreferenz oder ein Pfad zu einer .cdxml Datei sein. Resultiert in der dFormMain Basisklasse. Setzten Sie sie auf None wenn Sie keine Hauptform wollen, oder auf eine eigene Hauptform. Tun Sie dies vor dem Aufruf von dApp.start(), wie in: >>> import dabo >>> app = dabo.dApp() >>> app.MainFormClass = MyMainFormClass >>> app.start() (dForm)

source: Specifies the class to use for the browse grid.
de: Spezifiziert die Klasse zur Benutzung des Browserelements.

source: Specifies the class to use for the browse page.
de: Spezifiziert die Klasse zur Benutzung des Browserseite.

source: Specifies the class to use for the edit page.
de: Spezifiziert die Klasse zur Benutzung der Editierseite.

source: Specifies the class to use for the select page.
de: Spezifiziert die Klasse zur Benutzung für die Auwahlseite

source: Specifies the class to use for user preference persistence. The default UserSettingProviderClass will save user preferences inside the .dabo directory inside the user's home directory, and will be instantiated by Dabo automatically.
de: Spezifiziert Die Klasse zum speichern der Anwender-Voreinstellungen. Die vorgegebene UserSettingProviderClass speichert die Voreinstellungen innerhalb des .dabo Verzeichnisses des Anwender Heimatverzeichnis und wird von Dabo automatisch instantiiert.

source: Specifies the containing form.
de: Definiert das Behälter-Formular.

source: Specifies the current contents of the editor. (basestring)
de: Definiert den aktuellen Inhalt des Editors. (basestring)

source: Specifies the current state of the control (the value of the field). (varies)
de: Definiert den aktuellen Zustand des Elements (den Wert des Feldes). (unterschiedlich)

source: Specifies the current state of the control (the value of the field). (string)
de: Definiert den aktuellen Zustand des Elements (den Wert des Feldes). (str)

source: Specifies the current state of the control (the value of the field). (varies)
de: Bestimmt den aktuellen Zustand des Elements (den Wert des Feldes). (verschiedene Datentypen)

source: Specifies the data cursor that the report runs against.
de: Spezifiziert den Data Cursor, auf dem der Bericht arbeitet.

source: Specifies the data field of the dataset to use as the source of data. (str)
de: Bezeichnet das Feld des Dataset, das als Datenquelle zu nutzen ist. (str)

source: Specifies the dataset to use as the source of data. (str)
de: Bezeichnet den Datensatz, der als Datenquelle verwendet werden soll. (str)

source: Specifies the delay before incrementeal searching begins. (int) As the user types, the search string is modified. If the time between keystrokes exceeds SearchDelay (milliseconds), the search will run and the search string will be cleared. The value set here in the Application object will become the default for all objects that provide incremental searching application-wide.
de: Spezifiziert die Verzögerung bevor die inkrementielle Suche beginnt. (int) Bei der Eingabe wird ser Suchstring angepasst. Falls die Zeit zwischen den Tastendrücken die Vezögerung (Millisekunden) überschreitet, wird die Suche ausgeführt und der Suchbegriff gelöscht. Der hier gesetzte Wert wird der Anwendungweite Standardwert für alle Objekte, die eine inkrementielle Suche bereitstellen.

source: Specifies the dialog to use for the application's user preferences. If None, the application will try to run the active form's onEditPreferences() method, if any. Otherwise, the preference dialog will be instantiated and shown when the user chooses to see the preferences.
de: Spezifiziert den Dialog, der für die Anwendungseinstellungen benutzt wird. Wenn None, versucht die Anwendung die Methode onEditPreferences der aktiven Form auszuführen. Andernfalls wird der Einstellungsdialog instanziiert und angezeigt, wenn der Anwender die Einstellungen auswählt.

source: Specifies the encoding for unicode strings. (str)
de: Spezifiziert die Encodierung für Unicode strings. (str)

source: Specifies the form class to use for the application's About screen.
de: Spezifiziert die Formklasse, die für den About-Screen der Applikation benutzt werden soll.

source: Specifies the home directory for the report. Resources on disk (image files, etc.) will be looked for relative to the HomeDirectory if specified with relative pathing. The HomeDirectory should be the directory that contains the report form file. If you set self.ReportFormFile, HomeDirectory will be set for you automatically.
de: Bestimmt das Heimatverzeichnis für den Report. Nach Ressourcen auf der Festplatte (Bilddateien usw.) wird relativ zum HomeDirectory gesucht, wenn es als relativer Pfad angegeben ist. Das HomeDirectoy sollte dasjenige Verzeichnis sein, das die Datei des Report-Formulars enthält. Wenn self.ReportFormFile gesetzt ist, wird HomeDirectory automatisch gesetzt.

source: Specifies the home directory for the report. Resources on disk (image files, etc.) will be looked for relative to the HomeDirectory if specified with relative pathing. The HomeDirectory should be the directory that contains the report form file. If you set self.ReportFormFile, HomeDirectory will be set for you automatically. Otherwise, it will get set to self.Application.HomeDirectory.
de: Spezifiziert das Heimatverzeichnis für den Report. Resourcen auf der Festplatte (Bilddateien, etc.) werden relativ zum Heimatverzeichnis gesucht falls diese relativ angegeben wurden. Das Heimatverzeichnis sollte das Verzeichnis sein, das die Reportform enthält. Wenn Sie self.ReportFormFile setzten wird das Heimatverzeichnis automatisch für Sie gesetzt. Andernfalls wird es auf self.Application.HomeDirectory gesetzt.

source: Specifies the icon to use on all forms and dialogs by default. The value passed can be a binary icon bitmap, a filename, or a sequence of filenames. Providing a sequence of filenames pointing to icons at expected dimensions like 16, 22, and 32 px means that the system will not have to scale the icon, resulting in a much better appearance.
de: Spezifiziert das Standardsymbol aller Formen und Dialoge. Der übergebene Wert kann eine binäre Symbolbitmap, ein Dateiname, oder eine Reihe von Dateinamen sein. Bei Angabe einer Reihe von Symboldateien in Grossen von 16, 22 und 32 Pixeln bedeutet, das diese vom System nicht skaliert werden müssen. Dies resultiert in einer besseren Darstellung.

source: Specifies the location of the pageframe tabs. Valid values are: Top (default) Left Right Bottom This only applies when PageFrameStyle is set to "Tabs".
de: Bestimmt die Platzierung der Karteireiter des Seitenrahmens. Gültige Werte sind: Top (oben, Standard) Left (links) Right (rechts) Bottom (unten) Dies wirkt sich nur aus, wenn der PageFrameStyle auf "Tabs" gesetzt ist.

source: Specifies the message to initially display on the login form.
de: Spezifiziert die Nachricht, die auf der Login-Form zuerst anzuzeigen ist.

source: Specifies the number of attempts the user has to login successfully.
de: Spezifiziert die Anzahl Versuche, die der Benutzer für Login zur Verfügung hat.

source: Specifies the output PDF file (name or file object).
de: Spezifiziert die Ausgabe PDF Datei (Name der Datei):

source: Specifies the path and filename of the report form spec file.
de: Benennt Pfad- und Dateiname der Berichtsattributsdatei.

source: Specifies the python report form data dictionary.
de: Spezifiziert den Python Bericht vom Data Dictionary

source: Specifies the reference to the object providing user preference persistence. The default UserSettingProvider will save user preferences inside the .dabo directory inside the user's home directory.
de: Gibt die Referenz zum Objekt an, das die Voreinstellungen verwaltet. Der Standard UserSettingProvider speichert Benutzerpreferenzen im .dabo Verzeichnis innerhalb des Heimatverzeichnis des Benutzers.

source: Specifies the report format xml.
de: Spezifiziert das XML-Reportformat.

source: Specifies the style of pageframe to set up. Valid values are: Tabs (default) List (down the side) Select
de: Bestimmt die Art des Seitenrahmens. Gültige Werte sind: Tabs (Karteireiter, Standard) List (Liste an der Seite) Select (Auswahl)

source: Specifies the type of form this is. The type of form determines the runtime behavior. FormType can be one of: Normal: A normal dataNav form. The default. PickList: Only select/browse pages shown, and the form is modal, returning the Primary Key of the picked record. Edit: Modal version of normal, with no Select/Browse pages. User code sends the Primary Key of the record to edit.
de: Definiert den Typ dieses Formulars. Der Typ des Formulars bestimmt das Verhalten zur Laufzeit. FormType kann einen der folgenden Werte annehmen: Normal: Ein normales dataNav-Formular. Standardwert. PickList: Es werden nur Auswahl-/Blättern-Seiten angezeigt; das Formular ist modal und gibt den Hauptschlüssel des ausgewählten Datensatzes zurück. Edit: Modale Version des normalen Formulars, ohne Auswahl-/Blättern-Seiten. Eigener Code sendet den Hauptschlüssel des zu bearbeitenden Datensatzes.

source: Specifies the user interface to load, or None. (str) This is the user interface library, such as 'wx' or 'tk'. Note that 'wx' is the only supported user interface library at this point.
de: Gibt die zu ladende Benutzerschittstelle an. Dies ist die Benutzerschnittstellenbibliothek, so wie 'wx' oder 'tk'. Beachten Sie das 'wx' im Moment die einzige unterstützte Bibliothek ist.

source: Specifies whether a child bizobj gets requeried automatically. When True (the default) moving the record pointer or requerying the parent bizobj will result in the child bizobj's getting requeried as well. When False, user code will have to manually call child.requery() at the appropriate time.
de: Spezifiziert ob ein Detailbizobj automatisch neu selektiert wird. Falls True wird das Bizobj sofort neu selektiert wenn beim Hauptbizobj der Datensatz gewechselt oder das Hauptbizobj neu selektiert wird. (Vorgabe: True) (bool)

source: Specifies whether a timestamp is logged with the message. Default: True
de: Spezifiziert, ob ein Zeitstempel mit der Meldung geloggt wird. Vorgabe: True

source: Specifies whether the "Show Sizer Lines" option is shown in the menu. If True (the default), there will be a View|Show Sizer Lines option available in the base menu.
de: Spezifiziert ob die Option 'Show Sizer Lines' im Menü angezeigt wird. Wenn True (Vorgabe), wird die Option 'View/Show Sizer Lines' im Basismenü angezeigt.

source: Specifies whether the command window option is shown in the menu. If True (the default), there will be a File|Command Window option available in the base menu. If False, your code can still start the command window by calling app.showCommandWindow() directly.
de: Spezifiziert ob die Kommandofensteroption im Menü gezeigt wird. tab] Wenn True (default), ist im Dateimenü eine Kommandofensteroption tab] vorhanden. Wenn False, kann das Kommandofenster direkt über tab] den Aufruf von app.showCommandWindow() angezeigt werden.

source: Specifies whether the event is allowed to continue on to the next handler. (bool)
de: Spezifiziert ob der Event zum nächsten Handler weitergegeben wird.

source: Specifies whether the user accepted the dialog, or canceled. (bool)
de: Beschreibt, ob Benutzer den Dialog akzeptiert oder abgelehnt hat.

source: Specifies whether the user is required to login at app startup.
de: Gibt an, ob der User sich für die Anwendung anmelden muss.

source: Specifies whether this Bitmap button gets clicked on -Escape-.
de: Gibt an, ob click-Methode dieses Buttons bei Escape gefeuert wird.

source: Specifies whether this control can receive focus from keyboard navigation.
de: Definiert, ob dieses Element per Tastatursteuerung den Fokus erhalten kann.

source: Specifies which events to log. (list of strings) If the first element is 'All', all events except the following listed events will be logged. Event logging is resource-intensive, so in addition to setting this LogEvents property, you also need to make the following call: >>> dabo.eventLogging = True
de: Spezifiziert welche Events geloggt werden. (liste von strings) Ist das erste Element 'All', werden alle bis auf die folgenden Events geloggt. Das loggen der Events ist resourcenintensiv. Deshalb muss zusätzlich zur Angabe der Einstellung von LogEvents der folgende Aufruf erfolgen: >>> dabo.eventLogging = True

source: Spinner Properties
de: Eigenschaften des Spinners

source: Spinner values must be numeric. Invalid:'%s'
de: Spinner-Werte müssen nummerisch sein. '%s' ist ungültig.

source: Split
de: Aufteilen

source: State: %s (Boolean: %s)
de: Status: %s (Boolesch: %s)

source: String must be present in the choices.
de: String muss in den Wahlmöglichkeiten enthalten sein

source: String not in ISO 8601 format.
de: Die Zeichenkette ist nicht im ISO-8601-Format

source: Success!
de: Erfolgreich!

source: Table that is the primary source for the fields displayed on the page (str)
de: Tabelle, welche die Hauptdatenquelle für die Felder bildet, die auf der Form dargestellt werden (str)

source: Testing doDefault():
de: doDefault() wird getestet:

source: Text that appears in the title bar (str)
de: Text für die Titelzeile (str)

source: Text to display for null (None) values. (str)
de: Text zur Anzeige von Nullwerten (None). (str)

source: The UI cannot be reset once assigned.
de: Das UI kann nicht zurückgestellt werden, nachdem es einmal zugewiesen wurde .

source: The XML in '%s' is not well-formed and cannot be parsed: %s
de: Das XML in '%s' ist nicht richtig gestaltet und kann nicht geparst werden: %s

source: The base Dabo class of the object. Read-only. (class)
de: Die Dabo-Basisklasse des Objektes. Schreibgeschützt. (class)

source: The bitmap displayed on the button when it is depressed. (wx.Bitmap)
de: Die angezeigte Bitmap, wenn der Button gedrückt ist. (wx.Bitmap)

source: The bitmap displayed on the button when it receives focus. (wx.Bitmap)
de: Die auf dem Button angezeigte Bitmap, wenn der Button den Fokus erhält. (wx.Bitmap)

source: The bitmap normally displayed on the button. (wx.Bitmap)
de: Normalerweise auf dem Button angezeigte Bitmap. (wx.Bitmap)

source: The class the object is based on. Read-only. (class)
de: Die Klasse, von der das Object abgeleitet wurde. Read-only. (class)

source: The connectInfo for the connection. (dConnectInfo)
de: Die ConnectInfo für die Connection. (dConnectInfo)

source: The connection to the database has closed for unknown reasons. Any unsaved changes to the data will be lost. Database error message: %s
de: Die Verbindung zur Datenbank wurde aus unbekannten Gründen geschlossen. Alle ungesicherten Änderungen der Daten sind verloren. Fehlermeldung der Datenbank: %s

source: The containing object. (obj)
de: Die enthaltene Textbox. (obj)

source: The current Date of the calendar (datetime.date)
de: Aktuelles Datum des Kalenders (datetime.date)

source: The current position of the record pointer in the result set. (int)
de: Die gegenwärtige Position des Datensatzzeigers im Result Set. (int)

source: The cursor object for the currently selected key value. (dCursorMixin child)
de: Das Cursor Objekt des momentan ausgewählten Schlüsselwertes. (dCursorMixin Kind)

source: The database could not be setup. Contact your DB administrator.
de: Die Datenbank konnte nicht eingerichtet werden. Kontaktieren Sie den Datenbankadministrator.

source: The database name to login to. (str)
de: Name der Datenbank, in die eingelogged werden soll.

source: The default value for the field. Default:None (str)
de: Defaultwert für dieses Feld. Default:None (str)

source: The encrypted password of the user. (str)
de: Verschlüssektes Passwort des Nutzers (Zeichenkette)

source: The file '%s' cannot be found
de: Die Datei '%s' wurde nicht gefunden

source: The file has been modified on the disk since you opened it. Do you want to overwrite it?
de: Die Datei wurde von einem anderen Programm geändert, seit Sie sie geöffnet haben. Möchten Sie die Änderungen überschreiben?

source: The font '%s' doesn't exist on this system.
de: Die Schriftart '%s' existiert auf diesem System nicht.

source: The friendly title of the cursor, used in messages to the end user. (str)
de: Der anwenderfreundliche Titel des Cursors zur Anzeige von Meldungen für den Benutzer. (str)

source: The host name or ip address. (str)
de: Hostname oder IP Addresse. (str)

source: The list of event bindings ([Event, callback]) for this object.
de: Die Liste der Event-Bindings ([Event, callback]) für dieses Objekt.

source: The log's label: will get prepended to the log entry
de: Der Logtitel: wird dem Logeintrag vorangestellt

source: The long descriptive name of the logged-on user.
de: Der lange beschreibende Name des eingeloggten Benutzers.

source: The maximum length the entered text can be. (int)
de: Die Maximallänge für den eingegebenen Text. (int)

source: The name of the connection. (str)
de: Der Name der Connection. (str)

source: The name of the logged-on user. Read-only.
de: Name des angemeldeten Benutzers. Read-only.

source: The name of the object. (str)
de: Name des Objektes. (str)

source: The name of the table in the database that this cursor is updating.
de: Name der Tabelle in der Datenbank, den dieser Cursor verändert.

source: The name of the table. (str)
de: Der Name der Tabelle. (str)

source: The name used to reference this connection. (str)
de: Der benutze Name zur Referenzierung der Connection. (str)

source: The number of decimal places to the right of the period. (int)
de: Die Anzahl der dezimalen Stellen nach dem Komma. (int)

source: The number of records in the cursor's data set. It will be -1 if the cursor hasn't run any successful queries yet. (int)
de: Anzahl der Datensätze im Datenbestand. -1 wenn noch keine erfolgreiche Selektion ausgeführt wurde. (int)

source: The object %s does not support the Visible property.
de: Das Objekt %s unterstützt die Eigenschaft 'Visible' nicht.

source: The object reference to the main form of the application, or None. The MainForm gets instantiated automatically during application setup, based on the value of MainFormClass. If you want to swap in your own MainForm instance, do it after setup() but before start(), as in: >>> import dabo >>> app = dabo.dApp() >>> app.setup() >>> app.MainForm = myMainFormInstance >>> app.start()
de: Die Objektreferenz zur Hauptform der Anwendung, oder None. Die Hauptform wird automatisch während Initialisierung der Anwendung basierend auf den Wert der MainFormClass erzeugt. Wenn Sie eine eigende MainForm verwenden möchten, tun Sie dies nach setup() aber bevor start(), wie in: >>> import dabo >>> app = dabo.dApp() >>> app.setup() >>> app.MainForm = myMainFormInstance >>> app.start()

source: The object that is to receive the log messages.
de: Das Objekt, das die Logmeldungen empfängt.

source: The onCancel() handler is deprecated. Use the runCancel() method instead
de: Der onCancel()-Handler läuft aus. Verwende stattdessen die Methode runCancel().

source: The onOK() handler is deprecated. Use the runOK() method instead
de: Der onOK()-Handler läuft aus. Verwende stattdessen die Methode runOK().

source: The only accepted values for this property are
de: Gültige Werte für dieses Property sind

source: The only possible values are 'Default' and 'VC8', 'VC71', 'Fancy', or 'Firefox'
de: Die einzig möglichen Werte sind 'Default' und 'VC8', 'VC71', 'Fancy', oder 'Firefox'

source: The only possible values are 'Left' and 'Right'.
de: Die einzig möglichen Werte sind 'Left' und 'Right'.

source: The only possible values are 'Left', 'Center', and 'Right'
de: Die einzig möglichen Werte sind 'Left', 'Center', und 'Right'

source: The only possible values are 'Top' and 'Bottom'
de: Die einzig möglichen Werte sind 'Top' und 'Bottom'

source: The only possible values are 'Top', 'Left', 'Right', and 'Bottom'
de: Die einzig möglichen Werte sind 'Top', 'Left', 'Right' und 'Bottom'
