Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: Quick &Report
de: Schell%report

source: Quick Report
de: Schnellreport

source: Read-only object reference to the Dabo Application object. (dApp).
de: Read-only Objektverweis auf Dabo-Applications-Object. (dApp).

source: Read-only plain text description of the font (str)
de: Beschreibung des Zeichensatzes als einfacher Text, nur lesend. (str)

source: Record %s/%s
de: Datensatz %s/%s

source: Record Deleted.
de: Datensatz gelöscht

source: Reference to a wx.Rect that encompasses the drawn object (read-only) (wx.Rect)
de: Referenz auf ein wx.Rect, welches das gezeichnete Objekt begrenzt. (nur lesend) (wx.Rect)

source: Reference to the AUI manager (for internal use only). (_dDockManager)
de: Referenz auf den AUI-Manager (nur zum internen Gebrauch). (_dDockManager)

source: Reference to the Cancel button on the form, if present (dButton or None).
de: Referenz auf den Abbrechen-Knopf im Formular, falls vorhanden. (dButton oder None)

source: Reference to the Help button on the form, if present (dButton or None).
de: Referenz auf den Hilfe-Knopf im Formular, falls vorhanden. (dButton oder None)

source: Reference to the No button on the form, if present (dButton or None).
de: Referenz auf den Nein-Knopf im Formular, falls vorhanden. (dButton oder None)

source: Reference to the OK button on the form, if present (dButton or None).
de: Referenz auf den OK-Knopf im Formular, falls vorhanden. (dButton oder None)

source: Reference to the Preference Management object (dPref)
de: Referenz zum verwaltenden Objekt der Eigenschaften. (dPref)

source: Reference to the Yes button on the form, if present (dButton or None).
de: Referenz auf den Ja-Knopf im Formular, falls vorhanden. (dButton oder None)

source: Reference to the bizobj that 'owns' this data set. Default=None (bizobj)
de: Referenz zum Bizobj dem der Datenbestand zugehört. (Vorgabe=None) (bizobj)

source: Reference to the bizobj that 'owns' this data set. Default=None (dCursorMixin)
de: Referenz zum Bizobj dem der Datenbestand zugehört. (Vorgabe=None) (dCursorMixin)

source: Reference to the box used in the sizer (dBox)
de: Referenz auf die Box, die im Sizer verwendet wird. (dBox)

source: Reference to the center (i.e., non-docking) panel. (read-only) (dPanel)
de: Referenz auf das mittlere (d.h. nicht-andockende) Panel. (nur lesend) (dPanel)

source: Reference to the connection object for the bizobj being decorated (dabo.db.dConnection)
de: Referenz auf das Verbindungs-Objekt für das Bizobjekt, das dekoriert wird (dabo.db.dConnection)

source: Reference to the containing dSlidePanelControl.
de: Referenz auf das umgebende dSlidePanelControl.

source: Reference to the cursor that handles SQL Builder information (cursor)
de: Referenz auf den Cursor welcher die SQL Builder Informationen verarbeitet. (cursor)

source: Reference to the delete item button (wx.Button)
de: Referenz auf den Button zum löschen eines Eintrags (wx.Button)

source: Reference to the displayed calendar (read-only) (CalPanel)
de: Verweis auf den angezeigten Kalender (nur lesend) (CalPanel)

source: Reference to the edit item button (wx.Button)
de: Referenz auf den Button zum Bearbeiten eines Eintrags (wx.Button)

source: Reference to the internal table class (dGridDataTable)
de: Referenz auf die interne Tabellen-Klasse (dGridDataTable)

source: Reference to the main splitter in the form (dSplitter
de: Referenz auf den Haupt-Trenner im Formular (dSplitter)

source: Reference to the move item down button (wx.Button)
de: Referenz auf den Button zum Verschieben eines Eintrags nach unten (wx.Button)

source: Reference to the move item up button (wx.Button)
de: Referenz auf den Button zum Verschieben eines Eintrags nach oben (wx.Button)

source: Reference to the new item button (wx.Button)
de: Referenz auf den Button eines neuen Eintrags (wx.Button)

source: Reference to the object being drawn upon. (object)
de: Referenz auf das Objekt, auf das gezeichnet wird. (object)

source: Reference to the object that opens URLs and optionally authenticates. (read-only) (urllib2.urlopener)
de: Referenz auf das Objekt, das URLs öffnet und optional authentiziert. (nur lesend) (urllib2.urlopener)

source: Reference to the object that provides cryptographic services. (varies)
de: Referenz des Objekts, das cryptographischen Service bereitstellt. (varies)

source: Reference to the object that will handle files dropped on this control. When files are dropped, a list of them will be passed to this object's 'processDroppedFiles()' method. Default=None (object or None)
de: Referenz auf das Objekt, das Dateien behandeln soll, die auf dieses Element gezogen werden. Beim Fallenlassen wird der Methode 'processDroppedFiles()' dieses Objekts eine Liste von Dateien übergeben. Standard=None (object oder None)

source: Reference to the object that will handle text dropped on this control. When text is dropped, that text will be passed to this object's 'processDroppedText()' method. Default=None (object or None)
de: Referenz auf das Objekt, das Text behandeln soll, der auf dieses Element gezogen wird. Beim Fallenlassen wird der Methode 'processDroppedText()' dieses Objekts der Text übergeben. Standard=None (object oder None)

source: Reference to the object to which this control's Value is bound (object)
de: Objektreferenz, an welche der Wert des Controls gebunden ist.

source: Reference to the panel that contains the caption and buttons (wx.Panel)
de: Referenz auf das Panel, das Legende und Knöpfe enthält (wx.Panel)

source: Reference to the parent bizobj to this one. (dBizobj)
de: Referenz zum Hauptbizobj. (dBizobj)

source: Reference to the primary bizobj for this form (dBizobj)
de: Referenz auf das primäre Bizobj für dieses Formular (dBizobj)

source: Reference to the sizer item that control's this control's layout. This is useful for getting information about how the item is being sized, and for changing those settings.
de: Referenz auf den Sizer-Eintrag, der das Layout dieses Elements kontrolliert. Hiermit kann man herausfinden und ändern, wie der Eintrag dargestellt wird.

source: Reference to the sizer item that control's this control's layout. This is useful for getting information about how the item is being sized, and for changing those settings. (SizerItem)
de: Referenz auf den Sizer-Eintrag, der das Layout dieses Elements kontrolliert. Hiermit kann man herausfinden und ändern, wie das Element behandelt (gesized) wird. (SizerItem)

source: Reference to the sizer that controls this control's layout. (dSizer)
de: Referenz auf den Sizer, der das Layout dieses Elements kontrolliert. (dSizer)

source: Reference to the wizard form this page is in (Wizard object)
de: Referenz auf das Wizard-Formular, zu dem diese Seite gehört. (Wizard object)

source: References the current frontmost page. (dPage)
de: Referenz auf die aktuell vorderste Seite. (dPage)

source: References the object that emitted the event. (obj)
de: Referenziert das Object, das den Event gesendet hat. (obj)

source: Reflects the presence of the Alt key in the selected key combo. Default=False. (bool)
de: Ist die Alt-Taste in der ausgewählten Tastenkombination enthalten? Standard=False. (bool)

source: Reflects the presence of the Alt key in the selected key combo. Default=False. (read-only) (bool)
de: Ist die Alt-Taste in der ausgewählten Tastenkombination enthalten? Standard=False, nur-lesend. (bool)

source: Reflects the presence of the Ctrl key in the selected key combo. Default=False. (read-only) (bool)
de: Ist die Ctrl-Taste in der ausgewählten Tastenkombination enthalten? Standard=False, nur-lesend. (bool)

source: RegID '%s' conflicts with existing name
de: Die RegID '%s' ist bereits vergeben.

source: RegIDs cannot be changed once they are set
de: RegIDs können nicht verändert werden, nachdem sie gesetzt wurden.

source: Regular Form
de: Normales Formular

source: Remove sort on
de: Sortierung aufheben für

source: Repeat the last search
de: Letzte Suche wiederholen

source: Replacement Complete
de: Ersetzten abgeschlossen

source: Represents a record in the data set. You can address individual columns by referring to 'self.Record.fieldName' (read-only) (no type)
de: Repräsentiert einen Datensatz im Datenbestand. Einzelne Felder können mit self.Record.FELDNAME referenziert werden. (read-only) (kein Typ)

source: Represents whether the node is Expanded (True) or collapsed. (bool)
de: Ist der Knoten aus- (True) oder eingeklappt (False). (bool)

source: Requery Failed
de: Erneute Datenabfrage fehlgeschlagen

source: Requery Not Allowed
de: Erneute Datenabfrage nicht erlaubt

source: Requery dataset
de: Abfrage wiederholen

source: Requery failed with response: %s
de: Erneute Datenabfrage fehlgeschlagen: %s

source: Restore Old Version
de: Alte Version wiederherstellen

source: Restore...
de: Wiederherstellen...

source: Returns True if the current record is new and unsaved
de: Gibt True zurück, wenn der aktuelle Datensatz neu oder nicht gespeichert ist

source: Returns True if the current record is new and unsaved.
de: Gibt bei einem neuen oder nicht gespeicherten aktuellen Datensatz True zurück.

source: Returns True if this cursor is used for managing internal Dabo preferences and settings. Default=False. (bool)
de: Gibt True zurück, wenn dieser Cursor für die Verwaltung von Dabo Voreinstellungen benutzt wird. (Vorgabe=False). (bool)

source: Returns True if this is a MDI (Multiple Document Interface) form. (bool) Otherwise, returns False if this is a SDI (Single Document Interface) form. Users on Microsoft Windows seem to expect MDI, while on other platforms SDI is preferred. See also: the dabo.MDI global setting. (bool)
de: Ist dies ein MDI-Formular? (bool) Ist ansonsten False, wenn dies ein SDI-Formular ist. Benutzer von MS Windows scheinen MDI zu erwarten, während auf anderen Plattformen SDI bevorzugt wird Siehe auch: globale Einstellung dabo.MDI (bool) MDI = Multiple Document Interface, Benutzerschnittstelle mit mehreren Dokumenten SDI = Single Document Interface, Benutzerschnittstelle mit nur einem Dokument

source: Returns True if this is a Toolbar pane. Default=False (bool)
de: True, wenn dies ein Werkzeugleisten-Abschnitt (Toolbar pane) ist. Standard=False (bool)

source: Returns True if this is the root node (read-only) (bool)
de: Ergibt True, wenn dies der Wurzelknoten ist. (nur-lesend) (bool)

source: Returns True only if the current key is different than the starting value. (read-only) (bool)
de: Ergibt True, wenn die aktuelle Taste gegenüber dem Anfangswert verändert wurde. (nur-lesend) (bool)

source: Returns a dict of editable properties for the control, with the prop names as the keys, and the value for each another dict, containing the following keys: 'type', which controls how to display and edit the property, and 'readonly', which will prevent editing when True. (dict)
de: Gibt ein dict von bearbeitbaren Eigenschaften dieses Elements zurück, mit den Namen der Eigenschaften als Schlüssel und als Wert jeweils einem weiteren dict, mit den Schlüsseln 'type' (kontrolliert, wie das Element anzuzeigen und zu bearbeiten ist) und 'readonly' (verhindert das Bearbeiten, wenn True).

source: Returns a list containing the Value of all selected rows (list of str)
de: Ergibt eine Liste der Werte (Value) aller ausgewählten Zeilen. (list of str)

source: Returns a list of object references to the children of this object. Only applies to containers. Children will be None for non-containers. (list or None)
de: Ergibt eine Liste der Objektreferenzen auf die Kinder dieses Objekts. Nur bei Behälter-Objekten. Bei Nicht-Behältern ist Children=None. (list oder None)

source: Returns a list of selected row indices. (list of int)
de: Ergibt eine Liste von Indizes der ausgewählten Zeilen. (list of int)

source: Returns a list of the contained pages. (list)
de: Ergibt eine Liste der enthaltenen Seiten. (list)

source: Returns a reference to the currently displayed page (dPage | dPanel)
de: Ergibt eine Referenz auf die aktuell angezeigte Seite. (dPage oder dPanel)

source: Returns a reference to the index of the currently displayed page (int)
de: Ergibt eine Referenz auf den Index der aktuell angezeigten Seite. (int)

source: Returns a reference to the object defining backend-specific behavior (dBackend)
de: Gibt eine Referenz zum Objekt zurück, welches das Backend spezifische Verhalten definiert. (dBackend)

source: Returns a reference to the reportlab canvas object.
de: Gibt eine Referenz auf das Canvas-Objekt von Reportlab zurück.

source: Returns a reference to the sizer controlling the Ok/Cancel buttons. (dSizer)
de: Gibt eine Referenz auf den Sozer zurück, der die Ok-/Abbrechen-Knöpfe kontrolliert. (dSizer)

source: Returns current value (str)
de: Ergibt den aktuellen Wert. (str)

source: Returns the Bottom/Right panel. (SplitterPanel)
de: Ergibt das untere/rechte Panel. (SplitterPanel)

source: Returns the Bottom/Right panel. (dPanel)
de: Ergibt das untere/rechte panel. (dPanel)

source: Returns the SQL statement automatically generated by the sql manager.
de: Gibt den vom sql manager automatisch generierten SQL Befehl zurück.

source: Returns the Top/Left panel. (SplitterPanel)
de: Ergibt das obere/linke panel. (SplitterPanel)

source: Returns the Top/Left panel. (dPanel)
de: Ergibt das obere/linke panel. (dPanel)

source: Returns the current SQL that will be run, which is one of UserSQL or AutoSQL.
de: Gibt den aktuellen auszuführenden SQL Befehl zurück. Entspricht UserSQL oder AutoSQL

source: Returns the current column position of the cursor in the file (int)
de: Ergibt die aktuelle Position des Datei-Zeigers. (int)

source: Returns the current line number being edited (int)
de: Ergibt die Nummer der Zeile, die gerade bearbeitet wird. (int)

source: Returns the current page number at runtime.
de: Ergibt zur Laufzeit die aktuelle Seitenzahl.

source: Returns the current record number of Cursor.
de: Gibt die momentane Datensatznummer des Cursors zurück.

source: Returns the editor class used for cells in the column. This will be self.CustomEditorClass if set, or the default editor for the datatype of the field. (varies)
de: Ergibt die Editor-Klasse der Zellen dieser Spalte. Dies ist self.CustomEditorClass, falls gesetzt, oder der Standard-Editor für den Datentyp des Feldes. (verschiedene)

source: Returns the form that currently has focus, or None. (dForm)
de: Gibt die aktive Form zurück, oder None. (dForm)

source: Returns the form that currently has focus, or None. (dForm)
de: Gibt die momentan Form zurück, die momentan den Focus besitzt, oder None. (dForm)

source: Returns the index of the current frontmost page. (int)
de: Ergibt den Index der aktuell vordersten Seite. (int)

source: Returns the index of the last hit item.
de: Ergibt den Index des zuletzt getroffenen Elements.

source: Returns the index of the last selected item.
de: Ergibt den Index des zuletzt ausgewählten Eintrags.

source: Returns the index of this column in the parent grid.
de: Ergibt den Index dieser Spalte im übergeordneten Raster.

source: Returns the last executed SQL statement.
de: Gibt das zuletzt ausgeführte SQL Kommando zurück.

source: Returns the number of child menus. Read-only. (int)
de: Ergibt die Anzahl der Kind-Menus. Nur-lesend. (int)

source: Returns the number of pages in this pageframe (int)
de: Ergibt den Anzahl der Seiten in diesem Pageframe (int)

source: Returns the platform we are running on. This will be one of 'Mac', 'Win' or 'GTK'. (str)
de: Gibt die Platform zurück, auf der die Anwendung ausgeführt wird. Kann 'Mac', 'Win' or 'GTK' sein. (str)

source: Returns the position of the Ok/Cancel buttons in the sizer. (int)
de: Gibt die Position der Ok-/Abbrechen-Knöpfe im Sizer zurück. (int)

source: Returns the renderer class used for cells in the column. This will be self.CustomRendererClass if set, or the default renderer class for the datatype of the field. (varies)
de: Ergibt die Renderer-Klasse der Zellen dieser Spalte. Wenn gesetzt, ist dies self.CustomRendererClass, oder die Standard-Renderer-Klasse für den Datentyp des Feldes. (versch.)

source: Returns the root node if ShowRootNode is True; otherwise, returns all the nodes who are not children of other nodes (read-only) (list of nodes)
de: Ergibt den Wurzelknoten, wenn ShowRootNode Wahr ist; gibt ansonsten alle Knoten zurück, die keine Kinder anderer Knoten sind. (nur-lesend) (Liste von Knoten)

source: Returns the split status of the control (bool)
de: Ergibt den geteilt-Status des Elements (bool)

source: Returns the structure of the cursor in a tuple of 6-tuples. 0: field alias (str) 1: data type code (str) 2: pk field (bool) 3: table name (str) 4: field name (str) 5: field scale (int or None) This information will try to come from a few places, in order: 1) The explicitly-set DataStructure property 2) The backend table method
de: Gibt die Struktur des Positionszeigers zurück. 0: Feldalias (str) 1: Code des Datentyps (str) 2: Primärschlüsselfeld (bool) 3: Tabellenname (str) 4: Feldname (str) 5: Skalierung (int oder None) Diese Information resultiert der Reihe nach aus : 1) Die explizit angegebe Datenstruktur 2) Tabellenbeschreibung der DB

source: Returns/sets the text of this node. (str)
de: Ergibt/setzt den Text dieses Knotens. (str)

source: Right coordinate of the panel when floating (int)
de: Rechte Koordinate des Panels, wenn nicht angedockt. (int)

source: Rotate on Right Mouse Click and Drag
de: Rotiere beim Klicken-und-Ziehen

source: Row #%s requested, but the data set has only %s row(s),
de: Zeile Nr.%s angefordert, aber der Datensatz hat nur %s Zeile(n).

source: Row Height for all rows of the grid (int)
de: Zeilenhöhe für alle Zeilen des Rasters (int)

source: Run a Quick Report on the current dataset
de: Quickreport für aktuellen Datenbestand ausführen

source: SQL statement to run. If set, the automatic SQL builder will not be used.
de: SQL Befehl, der ausgeführt werden soll. Wenn angegeben, wird der SQL Builder nicht benutzt.

source: Save
de: Speichern

source: Save As
de: Speichern unter

source: Save Failed
de: Speichern fehlgeschlagen

source: Save any changes made to the records.
de: Alle Datensatzänderungen speichern.

source: Save changes
de: Änderungen speichern

source: Save failed.
de: Speichern fehlgeschlagen.

source: Save to:
de: Speichern unter:

source: ScaleMode must be either 'Clip', 'Proportional' or 'Stretch'.
de: ScaleMode muss entweder 'Clip', 'Proportional' oder 'Stretch' sein.

source: Secondary color for the caption bar. Only used in gradients (dColor)
de: Sekundärfarbe für den Beschriftungsbalken. Wird nur bei Verläufen verwendet (dColor)

source: SecurityManager must descend from dSecurityManager.
de: SecurityManager muß vom dSecurityManager abgeleitet werden.

source: SecurityManager previously set
de: SecurityManager war schon vorher gesetzt

source: Select
de: Auswählen

source: Select &All
de: &Alle auswählen

source: Select &First Record
de: &Erster Datensatz

source: Select &Last Record
de: &Letzter Datensatz

source: Select &Prior Record
de: &Vorherigen Datensatz auswählen

source: Select All
de: Alles auswählen

source: Select Application
de: Anwendung auswählen

source: Select Ne&xt Record
de: N&ächsten Datensatz auswählen

source: Select a file
de: Datei auswählen

source: Select all text
de: Ganzen Text selektieren

source: Selected text. (read-only) (str)
de: Ausgewählter Text (nur-lesend) (str)

source: Set Custom SQL
de: Spezifischen SQL Befehl eingeben

source: Set Key...
de: Taste definieren...

source: Set Selection &Criteria
de: Setzte Selection und Kriterium

source: Set the selection criteria for the recordset.
de: Selektionskriterien für Recordset setzen

source: Set user preferences
de: Benutzereinstellungen setzen

source: Sets the Bold of the Font (int)
de: Setzt die Schriftart auf fett (int)

source: Sets the Italic of the Font (int)
de: Setzt die Schriftart auf kursiv (int)

source: Sets the default border for the sizer. (int)
de: Setzt den Standard-Rahmen für den Sizer. (int)

source: Sets the face of the Font (int)
de: Setzt die Schriftart (int)

source: Sets the image that is displayed on the node. This is determined by the key value passed, which must refer to an image already added to the parent tree. When used to retrieve an image, it returns the index of the node's image in the parent tree's image list. (int)
de: Setzt das Bild, das auf diesem Knoten angezeigt wird. Der Schlüssel-Wert muss ein Bild bezeichnen, das bereits zum Eltern-Baum hinzugefügt wurde. Ergibt lesend den Index des Knoten-Bildes in der Bilderliste des Eltern-Baums. (int)

source: Sets the image that is displayed on the page tab. This is determined by the key value passed, which must refer to an image already added to the parent pageframe. When used to retrieve an image, it returns the index of the page's image in the parent pageframe's image list. (int)
de: Setzt das Bild, das auf dem Seiten-Karteireiter angezeigt wird. Der Schlüssel-Wert muss ein Bild bezeichnen, das bereits zum Eltern-Pageframe hinzugefügt wurde. Ergibt lesend den Index des Reiter-Bildes in der Bilderliste des Eltern-Pageframes. (int)

source: Sets the orientation of the sizer, either 'Vertical' or 'Horizontal'.
de: Setzt die Ausrichtung des Sizers, entweder 'Vertical' oder 'Horizontal'.

source: Sets the size of the Font (int)
de: Setzt die Schriftgröße (int)

source: Sets the visible icon for the wizard. (str/path)
de: Setzt das sichbare Icon für den Wizard. (str/path)

source: Setting FontSize to %s failed
de: Ändern der Schriftgröße (FontSize) auf %s ist fehlgeschlagen.

source: Setting to True (default) reduces display flicker (bool)
de: Wenn dies auf Wahr gesetzt wird (Standard), wird das Flackern der Anzeige reduziert. (bool)

source: Shorthand for (Xpos, Ypos). (2-tuple)
de: Abkürzung für (Xpos, YPos). (2-tuple)

source: Should new child records be added when a new parent record is added? (bool)
de: Sollen Detaildatensätze beim Anlegen von neuen Hauptdatensätzen erzeugt werden? (bool)

source: Should the bitmap be drawn transparently? (bool)
de: Soll das Bitmap transparent gezeichnet werden? (bool)

source: Should the form automatically add edit pages for child bizobjs? The default is False, and this property may be removed soon.
de: Soll das Formular automatisch Bearbeitungs-Seiten für abhängige Bizobjekte hinzufügen? Der Standardwert ist False, und diese Eigenschaft könnte bald entfernt werden.

source: Should the panel's Caption be shown when it is docked? Default=True (bool)
de: Soll die Titelzeile des Panels angezeigt werden, wenn angedockt ? Standard=True (bool)

source: Should the panel's border be shown when floating? (bool)
de: Sollen die Begrenzungslinien des Panels angezeigt werden, wenn nicht angedockt? (bool)

source: Show S&QL
de: Zeige S&QL

source: Show sort order
de: Zeige Sortierfolge

source: Show/Hide Sizer &Lines
de: Anzeigen/Verbergen von Sizer-&Lines

source: Side of the form that the panel is either currently docked to, or would be if dock() were to be called. Possible values are 'Left', 'Right', 'Top' and 'Bottom'. (str)
de: Seite des Formulars, an welches das Panel gerade angedockt ist oder angedockt würde, wenn dock() aufgerufen würde. Mögliche Werte sind 'Left', 'Right', 'Top' und 'Bottom'. (str)

source: Size in points for the Title (default=18). (int)
de: Grösse in pt für die Titelschriftart (default=18). (int)

source: Size in points for this font (int)
de: Größe der Schriftart in pt (int)

source: Size of images added to the tree. Default=(15, 15) (2-tuple of int)
de: Größe der Bilder, die dem Baum hinzugefügt werden. Standard=(15,12) (2-tuple von int)

source: Size of the box caption font (int)
de: Schriftgröße für die Titelzeile der Box (int)

source: Size of the font used for text objects (int)
de: Schriftgröße für Textobjekte (int)
