Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: Increase Font Size
de: Vergrössere Font

source: Indentation will only use space characters if useTabs is False; if True, it will use a combination of tabs and spaces (default=True) (bool)
de: Wenn useTabs falsch ist, werden nur Leerzeichen für den Einzug verwendet; ist useTabs wahr, wird eine Kombination von Tabulatoren und Leerzeichen verwendet (Vorgabe=True) (bool)

source: Index of the current page in the wizard (WizardPage)
de: Index der aktuellen Seite im Wizard (WizardPage)

source: Invalid Format value: %s
de: Ungültiger Wert für das Format: %s

source: Invalid InputCodes: %s
de: Ungültige InputCodes: %s

source: Invalid MousePointer value: '%s'
de: Ungültiger Wert für MausPointer: '%s'

source: Invalid Node State: %s
de: Ungültiger Status für einen Knoten: %s

source: Invalid Numeric Value: %s
de: Ungültiger nummerischer Wert: %s

source: Invalid Sort direction specified:
de: Ungültige Sortierreihenfolge ausgewählt

source: Invalid boolean replacement value: %s
de: Ungültiger boolescher Ersatzwert: %s

source: Invalid column %s specified for dListControl.ExpandColumn
de: Ungültige Spalte %s angegeben für dListControl.ExpandColumn

source: Invalid column number passed to 'showColumn()'.
de: Ungültige Spalten-Nummer an 'showColumn()' übergeben.

source: Invalid column specified for sort:
de: Ungültige Spalte für Sortierung ausgewählt

source: Invalid date value passed to getDate(): %s
de: Ein ungültiger Datumswert wurde an getDate() übergeben: %s

source: Invalid decimal value.
de: Ungültige Dezimalzahl.

source: Invalid dock position: '%s'.
de: Ungültige Dock-Position: '%s'.

source: Invalid replacement value: %s
de: Ungültiger Ersetzungswert: %s

source: Invalid row specified.
de: Ungültige Zeile gewählt

source: Invalid value passed for 'colNum' parameter: '%s'. Only column numbers or the word 'all' are valid.
de: Ungültiger Wert für 'colNum': '%s'. Nur Spaltennummern oder das Wort 'all' sind gültig.

source: Invalid value passed for 'rowNum' parameter: '%s'. Only row numbers or the word 'all' are valid.
de: Ungültiger Wert für 'rowNum': '%s'.Nur Zeilennummern oder das Wort 'all' sind gültig.

source: Invalid value passed to changeFontSize: %s
de: Ungültiger Wert übergeben für changeFontSize: %s

source: Invert Selection
de: Auswahl umkehren

source: Is every row the same height? (bool)
de: Sind alle Zeilen gleich hoch? (bool)

source: Is scrolling enabled in the horizontal direction? (bool)
de: Ist waagerechtes Rollen erlaubt? (bool)

source: Is scrolling enabled in the vertical direction? (bool)
de: Ist senkrechtes Rollen erlaubt? (bool)

source: Is the LED is on? Default=False (bool)
de: Ist die 'Leuchtdiode' an? (Vorgabe=False) (bool)

source: Is the link underlined in the normal state? (bool)
de: Wird der Link im Normalzustand unterstrichen? (bool)

source: Is the link underlined in the visited state? (bool)
de: Wird der Link unterstrichen, wenn er besucht wurde? (bool)

source: Is the link underlined when the mouse passes over it? (bool)
de: Wird der Link unterstrichen, wenn die Maus darüber steht? (bool)

source: Is the panel main area hidden? (bool)
de: Ist der Hauptbereich des Panels versteckt? (bool)

source: Is the panel main area visible? (bool)
de: Ist der Hauptbereich des Panels sichtbar? (bool)

source: Is the panel shown? (bool)
de: Wird das Panel angezeigt? (bool)

source: Is the surrounding box visible? (bool)
de: Ist die umgebende Box sichtbar? (bool)

source: Is this dialog positioned above its owner? Default=False (bool)
de: Liegt dieser Dialog über seinem Eigner? Standard=False (bool)

source: Is this menu item checked? (bool)
de: Ist dieser Menüeintrag angekreuzt? (bool)

source: Is this node selected?. (bool)
de: Ist dieser Knoten ausgewählt? (bool)

source: Italic setting for text objects (bool)
de: Kursiv-Einstellung für Text-Objekte (bool)

source: Italic setting for this font (bool)
de: Kursiv-Einstellung für diese Schriftart (bool)

source: Items in the list to sort. (list)
de: Einträge der zu sortierenden Liste. (list)

source: Keeps the form on top of all other forms. (bool)
de: Lässt das Formular über allen anderen Formularen schweben (bool)

source: Key combination that will trigger the menu (str)
de: Tastenkombination, die das Menü aufruft (str)

source: Keys must be a dictionary or list/tuple.
de: Keys müssen ein dictionary oder list/tuple sein.

source: Label for the x-axis (string)
de: Beschriftung für die x-Achse (str)

source: Label for the y-axis (string)
de: Beschriftung für die y-Achse (str)

source: Last
de: Letzter

source: Last SQL
de: Letztes SQL

source: Left coordinate of the panel when floating (int)
de: Linke Koordinate des Panels, wenn nicht angedockt. (int)

source: Length of the selected text, or 0 if nothing is selected. (int)
de: Länge des ausgewählten Textes; 0, wenn nichts ausgewählt ist (int)

source: Line style (solid, dash, dot) drawn (str)
de: Verwendeter Linien-Stil (solid, dash, dot) (str)

source: List of all nodes for which this is their parent node. (list of dNodes)
de: Liste aller Knoten, für welche dies der Elternknoten ist (Liste von dNodes)

source: List of all nodes for which this node is a direct ancestor. (list of dNodes)
de: Liste aller Knoten, für welche dies ein direkter Ahn ist (Liste von dNodes)

source: List of all nodes with the same parent node. (list of dNodes)
de: Liste aller Knoten mit dem gleichen Eltern-Knoten (Liste von dNodes)

source: List of all of the traces currently being plotted (list)
de: Liste aller Spuren, die zur Zeit gezeichnet werden (list)

source: List of all panels in the control (list))
de: Liste aller Panels in diesem Control (list)

source: List of all the pages. (list)
de: Auflistung aller Seiten. (list)

source: List of all the sizer items managed by this sizer (list of sizerItems
de: Liste aller Sizer-Einträge, die von diesem Sizer verwaltet werden (list of sizerItem)

source: List of all the sizers that are directly managed by this sizer (list of sizers
de: Liste aller Sizer, die direkt von diesem Sizer verwaltet werden (list of Sizer)

source: List of all the spacer items that are directly managed by this sizer (list of spacer items
de: Liste aller Spacer, die direkt von diesem Sizer verwaltet werden (list of Spacer)

source: List of all the windows that are directly managed by this sizer (list of controls
de: Liste aller Fenster, die direkt von diesem Sizer verwaltet werden (list of controls)

source: List of child objects.
de: Liste der Kindobjekte.

source: List of contained panels. Same as the 'Children' property. (read-only) (list)
de: Liste enthaltener Panels. Gleich der 'Children'-Eigenschaft. (nur lesend) (list)

source: List of dColumns, same as self.Columns. (list)
de: Liste von dColumns, das gleiche wie self.Columns (list)

source: List of dColumns. (list)
de: Liste von dColumns (list)

source: List of the fields in the table. (list)
de: Liste der Feldnamen in der Tabelle. (List)

source: List of the indexes in the table. (list)
de: Liste der Indices der Tabelle. (list)

source: List of the row labels. (list)
de: Liste der Zeilen-Bezeichnungen (list)

source: List that contains the entries in the control (list)
de: Liste, welche die Einträge des Controls enthält (list)

source: ListSpacing is not supported in wxPython %s
de: ListSpacing wird von wxPython %s nicht unterstützt.

source: Logical operation for how the drawing is done. Can be one of: (str) copy (or None) - default invert and and_invert and_reverse clear equiv nand nor no_op or or_invert or_reverse set src_invert xor
de: Logische Operation mit der das Zeichnen ausgeführt wird. Eine der folgenden: (str) copy (oder None) - Vorgabe invert and and_invert and_reverse clear equiv nand nor no_op or or_invert or_reverse set src_invert xor

source: Login incorrect, please try again. (%s/%s)
de: Login fehlgeschlagen, bitte nochmals versuchen. (%s/%s)

source: Main color for the caption bar (dColor)
de: Hauptfarbe für den Legenden-Balken (dColor)

source: Maximum allowable height for the control in pixels. (int)
de: Maximal erlaubte Höhe für das Element in Pixeln (int)

source: Maximum allowable size for the control in pixels. (2-tuple of int)
de: Maximal erlaubte Größe für das Element in Pixeln (2er-Tupel aus int)

source: Maximum allowable width for the control in pixels. (int)
de: Maximal erlaubte Breite für das Element in Pixeln (int)

source: Maximum value for the control (int/float)
de: Maximaler Wert für das Element (int/float)

source: Menu
de: Menü

source: Menu Keys
de: Menü-Tasten

source: Menu used to display the controls. Generated by List (dMenu)
de: Menü, das zur Anzeige der Elemente verwendet wird. Erzeugt durch List (dMenu)

source: Method '%s' of object '%s' has the following error: %s
de: Methode '%s' von Objekt '%s' hat den folgendenFehler: %s

source: Minimum allowable height for the control in pixels. (int)
de: Minimal erlaubte Höhe für das Element in Pixeln (int)

source: Minimum allowable size for the control in pixels. (2-tuple of int)
de: Minimal erlaubte Größe für das Element in Pixeln (2er-Tupel aus int)

source: Minimum allowable width for the control in pixels. (int)
de: Minimal erlaubte Breite für das Element in Pixeln (int)

source: Minimum height for the panel. Default=10px (int)
de: Minimale Höhe für das Panel. Vorgabe=10px (int)

source: Minimum value for the control (int/float)
de: Minimaler Wert für das Element (int/float)

source: Minimum width for the panel. Default=10px (int)
de: Minimale Breite für das Panel. Vorgabe=10px (int)

source: MultipleSelect for dCheckList is always True.
de: MultipleSelect ist für dCheckList immer True.

source: Must be passed at construction time. When set to True, the dialog displays without a title bar or borders (bool)
de: Muss zur Erstellungszeit übergeben werden. Wenn wahr, wird der Dialog ohne Titelbalken oder Rahmen angezeigt. (bool)

source: MyTest.myMethod called.
de: MyTest.myMethod wurde aufgerufen

source: MyTest1.myMethod called.
de: MyTest1.myMethod wurde augerufen

source: Name of encoding to use for unicode (str)
de: Name der Unicode Kodierung (str)

source: Name of field that is the PK. If multiple fields make up the key, separate the fields with commas. (str)
de: Name des Primärschlüssels. Besteht dieses aus mehreren Feldern, sind diese durch Kommas getrennt. (str)

source: Name of the backend database type. (str)
de: Name des Backend Datenbank-Types (Zeichenkette)

source: Name of the connection used for data access (str)
de: Name der Verbindung, die für den Datenzugriff benutzt wird (str)

source: Name of the field in the parent table that is used to determine child records. If empty, it is assumed that the parent's PK is used (str)
de: Name des Feldes der Haupttabelle das zur Ermittlung des Detaildatensatzes dient. Bei Nichtverwendung wird der Primärschlüssel verwendet. (str)

source: Name of the field that is the foreign key back to the parent. (str)
de: Name des Fremdschlüsselfeldes zum Hauptdatensatz. (str)

source: Name of the file being edited (without path info) (str)
de: Name der Datei, die bearbeitet wird (ohne Pfad) (str)

source: Name of the font face (str)
de: Name der Schriftart (str)

source: Name of the font face used for the Title. (string)
de: Name der Schriftart für den Titel. (string)

source: Name of the font face used in the editor (str)
de: Name der Schriftart, die im Editor verwendet wird (str)

source: Name of the font face used in the shell (str)
de: Name der Schriftart, die auf der Kommandozeile (Shell) verwendet wird (str)

source: Name of the index. (str)
de: Name des Index (str)

source: Nested sizer missing its ControllingSizer
de: Dem untergeordneten Sizer fehlt sein ControllingSizer.

source: New
de: Neu

source: Next
de: Nächster

source: Next >
de: Weiter >

source: No Active Form
de: Keine aktive Form

source: No Primary Key defined in the Bizobj for %s
de: Im Bizobj wurde kein Primärschlüssel für '%s' angegeben.

source: No Records
de: Keine Datensätze

source: No Update Needed
de: Keine Aktualisierung nötig

source: No apparent way to redo.
de: Es gibt keine offensichtliche Möglichkeit, dies zu wiederholen.

source: No apparent way to undo.
de: Es gibt keine offensichtliche Möglichkeit, dies rückgängig zu machen.

source: No base key set; preference will not be persisted.
de: Kein Basisschlüssel gesetzt; Eigenschaft wird nicht gespeichert.

source: No changed files available for %s.
de: Für %s sind keine geänderten Dateien vorhanden.

source: No connection named '%s' is defined
de: Es ist keine Verbindung des Namens '%s' definiert

source: No data to cancel.
de: Keine Daten zum Abbruch vorhanden.

source: No data to save
de: Es sind keine Daten zu speichern

source: No field specified for seek()
de: Kein Feld für seek() gewählt

source: No key field defined for table:
de: Es wurde kein Schlüsselfeld für die Tabelle angegeben.

source: No project specified for _updateFramework()
de: Kein Projekt angegeben für _updateFramework()

source: No radio button matching '%s' was found.
de: Es konnte kein Radio-Button mit '%s' gefunden werden.

source: No record to delete
de: Kein Datensatz zur Löschung vorhanden.

source: No records
de: Keine Datensätze

source: No records deleted
de: Keine Datensätze gelöscht

source: No records in data set
de: Keine Datensätze im Data Set

source: No records in dataset.
de: Keine Datensätze im Dataset

source: No records in the data set
de: Keine Datensätze im Data Set

source: No records in the data set.
de: Keine Datensätze im Data Set

source: No records updated
de: Keine Datensätze aktualisiert

source: No records were saved.
de: Es wurden keine Datensätze gesichert.

source: No table has been defined for this bizobj.
de: Für dieses Bizobj wurde keine Tabelle angegeben.

source: No tables have been setup for autocreation.
de: Es wurden keine Tabellen für die automatische Erzeugung eingerichtet.

source: No updates are available now.
de: Derzeit stehen keine Aktualisierungen zur Verfügung.

source: Non-date value in %s: '%s' is type '%s'
de: Wert in %s ist kein Datum: '%s' ist vom Typ '%s'

source: Non-existent field '%s'
de: Nicht-Existierendes Feld '%s'

source: Non-standard directory '%s' requested
de: Außergewöhnliches Verzeichnis '%s' angefordert

source: Normal (unvisited) link text color. (str or tuple)
de: Textfarbe für normale (noch nicht besuchte) Links (str oder tuple)

source: Normal Font Size
de: Normale Schriftgrösse

source: Normal Zoom
de: Normale Vergrößerung

source: Normally None, but you can set it to some other image to have the wizard display a different picture for this page (None or image path)
de: Normalerweise None; wenn der Wizard für diese Seite an anderes Bild anzeigen soll, kann man das hier angeben (None oder Bild-Pfad)

source: Normally new, unmodified records are not saved. If you need this behavior, set this to True. (bool)
de: Auf True setzen damit auch unmodifizierte Datensätze gespeichert werden. (bool)

source: Not found
de: Nicht gefunden

source: Nothing to delete!
de: Nichts zu Löschen!

source: Nothing to save!
de: Es gibt nichts zu speichern.

source: Number of child panels. (read-only) (int)
de: Anzahl der abhängigen Panels (nur lesbar) (int)

source: Number of columns in the control (int)
de: Spalten-Anzahl in diesem Control (int)

source: Number of columns in the grid. (int)
de: Spalten-Anzahl in diesem Grid (int)

source: Number of decimal places to display for float values (int)
de: Anzahl der Dezimalstellen, die bei Fließkommazahlen angezeigt werden soll (int)

source: Number of frames in the current image. Will be 1 for most images, but can be greater for animated GIFs, ICOs and some TIFF files. (read-only) (int)
de: Anzahl der Frames im aktuellen Bild. Normalerweise 1, kann bei animierten GIFs, ICOs und manchen TIFF-Dateien aber höher sein. (nur lesend, int)

source: Number of items in the control. -> Integer. Read-only.
de: Anzahl der Einträge in diesem Element -> Integer. Nur lesbar.

source: Number of pages in this wizard (int)
de: Anzahl der Seiten in diesem Wizard (int)

source: Number of rows in the control (read-only). (int)
de: Zeilen-Anzahl im Control (nur lesend, int)

source: Number of rows in the control (read-only). Alias for RowCount (int)
de: Zeilen-Anzahl im Control, Alias für RowCount (nur lesend, int)

source: Number of rows in the grid. (int)
de: Zeilen-Anzahl in diesem Grid (int)

source: Number of seconds to wait between successive login attempts.
de: Anzahl der Sekunden, die zwischen aufeinanderfolgenden Logins zu warten ist.

source: OK
de: Bestätigen

source: Object reference to the dForm containing the object. Read-only. (dForm).
de: Objektreferenz zur dForm, welche das Objekt enthält. Schreibgeschützt. (dForm)

source: Once a day
de: Einmal am Tag

source: Once a month
de: Einmal im Monat

source: Once a week
de: Einmal pro Woche

source: Only .cdxml forms can be re-loaded
de: Nur .cdxml-Formulare können neu geladen werden.

source: Open
de: Öffnen

source: Open up a command window for debugging
de: Öffne Befehlsfenster zum Debuggen

source: Open up a debug output window
de: Debugger-Ausgabe-Fenster öffnen

source: Optional color for the background of the column header (str)
de: Optionale Hintergrundfarbe für den Spaltenkopf (str)

source: Optional color for the background of the column headers. (str or None) This is only the default: setting the corresponding dColumn property will override.
de: Optionale Hintergrundfarbe für die Spaltenköpfe (str oder None) Dies ist nur die Vorgabe: die jeweilige dColumn-Eigenschaft übersteuert dies.

source: Optional color for the foreground (text) of the column header (str)
de: Optionale Vordergrundfarbe für den Text des Spaltenkopfes (str)

source: Optional color for the foreground (text) of the column headers. (str or None) This is only the default: setting the corresponding dColumn property will override.
de: Optionale Vordergrundfarbe für den Text der Spaltenköpfe (str oder None) Dies ist nur die Vorgabe: die jeweilige dColumn-Eigenschaft übersteuert dies.

source: Optional object associated with this node. Default=None (object)
de: Optionales Objekt, das mit diesem Knoten verbunden ist. Vorgabe=None (object)

source: Order of this column. Columns in the grid are arranged according to their relative Order. (int)
de: Ordnungszahl dieser Spalte. Spalten im Grid werden nach ihrer relativen Reihenfolge angeordnet. (int)

source: PK '%(pk)s' not present in dataset for DataSource '%(ds)s'
de: Hauptschlüssel (PK) '%(pk)s' ist im Datensatz für Datasource '%(ds)s' nicht vorhanden.

source: PK Value %s not found in the dataset
de: Primärschlüssel %s wurde im Datenbestand nicht gefunden

source: Page %s
de: Seite %s

source: Page: %d
de: Seite: %d

source: Parent must descend from dBizobj
de: Basisklasse muss von dBizObj abgeleitet sein

source: Password
de: Passwort:

source: Paste text from clipboard
de: F�gt Text aus Zwischenablage ein

source: Path to the .mnxml file that defines this form's menu bar (str)
de: Pfad zur .mnxml-Datei, die den Menübalken dieses Formulars definiert (str)

source: Path to the connection file used for data access (str)
de: Pfad zur Verbindungs-Datei, die für den Datenzugriff verwendet wird (str)

source: Path to the file (or file-like object) to be used for logging all database activity. Default=None, which means no log is kept. (file or str)
de: Pfad der Datei, die zum loggen aller Datenbankaktivitäten benutzt wird. Default=None, d.H. kein Logging. (file or str)

source: Percentage of the split window given to Panel1. Range=0-100 (float)
de: Anteil des geteilten Fensters für Panel 1 in Prozent. Spanne=0–100 (float)

source: Permission Denied
de: Zugriff verweigert

source: Pick this record
de: Wähle diesen Datensatz

source: Picture displayed when the button is pressed (str)
de: Bild, das angezeigt wird, wenn man den Knopf drückt (str)

source: Picture used for the normal (unselected) state (str)
de: Bild, das im normalen (nicht aktivierten) Zustand angezeigt wird (str)

source: Plain-text password for authentication on the remote server. (str)
de: Klartext-Kennwort zur Authentizierung auf dem entfernten Server. (str)

source: Please enter a string:
de: Bitte Zeichnkette eingeben:

source: Please enter your login information.
de: Bitte Login Informationen eintragen.

source: Please make your selection:
de: Bitte Auswählen

source: Please wait... requerying dataset...
de: Bitte warten... Lese Daten...

source: Point increase/decrease from normal viewing size (int)
de: Punkt-Erhöhung/Herabsetzung von der normalen Ansichtsgröße aus (int)

source: Popup to display the command history (read-only) (dDialog)
de: Popup-Dialog für die Anzeige der Befehls-Historie (nur lesend) (dDialog)

source: Position in pixels of the bottom side of the panel. Read-only when docked; read-write when floating (int)
de: Pixel-Position der unteren Seite des Panels. Nur-lesend, wenn angedockt; schreibbar, wenn schwebend. (int)

source: Position in pixels of the height of the panel. Read-only when docked; read-write when floating (int)
de: Höhe des Panels in Pixeln. Nur-lesend wenn angedockt; sonst schreibbar. (int)

source: Position in pixels of the left side of the panel. Read-only when docked; read-write when floating (int)
de: Position der linken Seite des Panels in Pixeln. Nur-lesend wenn angedockt; sonst schreibbar (int)

source: Position in pixels of the right side of the panel. Read-only when docked; read-write when floating (int)
de: Position der linken Seite des Panels in Pixeln. Nur-lesend wenn angedockt; sonst schreibbar. (int)

source: Position in pixels of the top side of the panel. Read-only when docked; read-write when floating (int)
de: Position der oberen Seite des Panels in Pixeln. Nur lesend, wenn angedockt, sonst auch schreibbar. (int)

source: Position in pixels of the width of the panel. Read-only when docked; read-write when floating (int)
de: Position der Breite des Panels in Pixeln. Nur lesens, wenn angedockt, auch schreibbar, wenn schwebend (int)

source: Position of the beginning of the selected text. If no text is selected, returns the Position of the insertion cursor. (int)
de: Position des Anfangs des ausgewählten Textes. Wenn kein Text ausgewählt ist, Position des Einfüge-Cursors. (int)

source: Position of the end of the selected text (int)
de: Position des Endes des ausgewählten Textes (int)

source: Position of the end of the selected text. If no text is selected, returns the Position of the insertion cursor. (int)
de: Position des Endes des ausgewählten Textes. Wenn kein Text ausgewählt ist, Position des Einfüge-Cursors. (int)

source: Position of the insertion point within the control (int)
de: Position des Einfügepunktes innerhalb des Elements (int)

source: Position of the panel when floating (2-tuple of ints)
de: Position des Panels, wenn schwebend. (2er-Tupel aus int)

source: Position of the sash when the window is split. (int)
de: Position der Trennleiste, wenn das Fenster geteilt ist. (int)

source: Position of the start of the selected text (int)
de: Position des Anfangs des ausgewählten Textes.

source: Position of this panel within the parent container (int)
de: Position dieses Panels innerhalb des Eltern-Behälters (int)

source: Pr&eferences
de: &Einstellungen

source: Preferences
de: Einstellungen

source: Press Ctrl-Delete to clear the key
de: Drücken Sie Strg-Entf um die Taste zu löschen

source: Press the desired key combination
de: Drücken Sie die gewünschte Tastenkombination

source: Primary key field does not exist in the data set:
de: Primärschlüsselfeld existiert nicht im Datensatz.:

source: Print Preview
de: Druckvorschau

source: Prior
de: Vorheriger

source: Provides runtime access to bands of the currently running report.
de: Erlaubt den Zugriff auf die Begrenzungen des momentan laufenden Reports zur Laufzeit.
