Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: The port to connect on (may not be applicable for all databases). (int)
de: Connection Port (evtl. nicht für alle Datenbanken zutreffend) (int)

source: The primary key of the table. (str)
de: Der Primärschlüssel der Tabelle. (str)

source: The server has the following app(s):
de: Der Server bietet folgende Anwendung(en):

source: The size required for the column in bytes or character units if it's a string. (int)
de: Spaltengröße in Byte oder die Anzahl der Buchstaben erforderlich, falls es sich um eine Zeichenkette handelt

source: The table definition for this bizobj. (object)
de: Die Tabelle für dieses Bizobj. (object)

source: The text that appears as the title of the page (str)
de: Der text, der als Titel der Seite erscheint (str)

source: The text that appears in the dialog's title bar (str)
de: Der Text, der in der Titelzeile des Dialogs erscheint (str)

source: The title of the cursor. Used in resolving DataSource references. (str)
de: Der Titel des Cursors. Wird zur Auflösung von Referenzen auf Datenquellen benutzt.

source: The total number of decimal places (int)
de: Die Anzahl der dezimalen Stellen (int)

source: The tuple of groups that the user belongs to. Business objects can be configured to selectively allow/deny various types of access based on the group(s) of the logged-in user.
de: Eine Tuple der Gruppen denen der Benutzer angehört. tab] Basierend auf den Gruppen, denen der Benutzer angehört, tab] kann die Zustimmung/Verweigerung des Zugriffs des angemeldeten tab] Benutzers konfiguriert werden.

source: The type of the column. (class)
de: Der Typ der Spalte. (class)

source: The type of the column. (str)
de: Datentyp des Feldes (str)

source: The underlying UI toolkit does not support modal forms. Use a dDialog instead.
de: Die zugrundeliegende Benutzeroberfläche unterstützt keine modalen Dialoge. Verwenden Sie stattdessen einen dDialog.

source: The user name. (str)
de: Der Benutzername. (str)

source: There is no active form to capture.
de: Es gibt kein aktives Formular zu erfassen.

source: There was a problem getting a response from the Dabo site. Please check your internet connection and try again later.
de: Es gab ein Problem, eine Antwort von der Dabo-Site zu bekommen. Bitte überprüfen Sie Ihre Internetverbindung und versuchen es später noch einmal.

source: There were no changed files available - your system is up-to-date!
de: Es waren keine geänderten Datein verfügbar – Ihr System ist auf dem neuesten Stand.

source: This Space For Rent
de: Noch zu vermieten

source: This is the fifth (and last) page
de: Dies ist die fünfte (und letzte) Seite

source: This is the first page
de: Dies ist die erste Seite

source: This is the fourth page
de: Dies ist die vierste Seite

source: This is the last page. Note that the 'Next' button now reads 'Finish'. Click that to exit, or click 'Back' to play some more.
de: Dies ist die letzte Seite. Beachten Sie, dass der 'Weiter'-Knopf jetzt mit 'Beenden' beschriftet ist. Klicken Sie auf diesen zum Beenden, oder klicken Sie auf 'Zurück', um weiterzuspielen.

source: This is the second page
de: Dies ist die zweite Seite

source: This is the third page
de: Dies ist die drittte Seite

source: This key combination is assigned to the menu command '%s'.
de: Diese Tastenkombination ist dem Menübefehl '%s' zugeordnet.

source: This property is deprecated, and will be removed in the next version of the framework. Use the 'UserSQL' property instead.
de: Diese Eigenschaft ist auslaufend und wird in der nächsten Version des Frameworks entfernt. Benutze stattdessen die Eigenschaft 'UserSQL'.

source: This will delete all records in the recordset, and cannot be canceled. Are you sure you want to do this?
de: Diese Aktion löscht alle Datensätze im Recordset und kann nicht rückgängig gemacht werden. Die Aktion wirklich ausführen?

source: This will delete the current record from %s, and cannot be canceled. Are you sure you want to do this?
de: Diese Aktion löscht den aktuellen Datensatz aus %s und kann nicht rückgängig gemacht werden. Die Aktion wirklich ausführen?

source: Top coordinate of the panel when floating (int)
de: Obere Koordinate des Panels, wenn nicht angedockt. (int)

source: Total number of lines in the document (int)
de: Anzahl der Zeilen im Dokument (int)

source: Tried to set UI to '%s', but it failed.
de: Es wurde versucht, UI auf '%s' umzustellen, aber dies ist fehlgeschlagen.

source: Tuple of field names and types, as returned by the backend (tuple)
de: Tuple von Feldnamen und Typen, wie Sie vom Backend zurückgegeben werden (tuple)

source: Type of data for this field (str)
de: Datentyp für diese Feld (str)

source: URL for the remote server (read-only) (str)
de: URl für den entfernten Server (nur lesend) (str)

source: URL for this link (str)
de: URL für diesen Link (str)

source: Undo last action
de: Letzte Aktion rückgängig machen

source: Unicode or string required.
de: Unicode oder string benötigt

source: Unselect All
de: Gesamte Auswahl aufheben

source: Update Conflict: the value in column '%s' has been changed by someone else.
de: Aktualisierungs-Konflikt: Der Wert in Spalte '%s' wurde von jemand anderem geändert.

source: User interface already set to '%s', so dApp didn't touch it.
de: Die Benutzerschnittstelle war bereits auf '%s' eingestellt, keine Änderung von dApp.

source: User interface set set to None.
de: User interface ist nicht gesetzt (None).

source: User interface set to '%s' by dApp.
de: User Interface wurde durch dApp auf '%s' gesetzt.

source: Username
de: Benutzername:

source: Username for authentication on the remote server (str)
de: Benutzername für die Authentizierung auf dem entfernten Server

source: View
de: Ansicht

source: WARNING: No BasePrefKey has been set for this application.
de: WARNUNG: Für diese Anwendung wurde kein BasePrefKey gesetzt.

source: Web Update
de: Internet-Aktualisierung

source: Web Updates
de: Internet-Aktualisierungen

source: When True (default), table and column names are enclosed with quotes during SQL creation in the cursor. (bool)
de: Gibt an, ob Tabellen- und Feldnamen bei der Ausführung von Hochkommas umschlossen werden. Vorgabewert ist True. (bool)

source: When True (default), table and column names are enclosed with quotes during SQL creation. (bool)
de: Wenn True (Vorgabe), werden Tabellen und Feldnamen während der Erzeugung der SQL Befehle in Anführungszeichen gesetzt.

source: When True, classes are mixed-in with the DesignerControlMixin (bool)
de: Wenn True, sind Klassen mixed-in mit DesignerControlMixin (bool)

source: When True, the control is not running live, but being used in design mode. Default=False. (bool)
de: Wenn True, läuft das Element nicht "live", sondern wird im Entwurfsmodus verwendet. Standard=False. (bool)

source: When True, the cursor object runs its query immediately. This is useful for lookup tables or fixed-size (small) tables. (bool)
de: Wenn True wird die Selektion sofort ausgeführt. Dies ist Nützlich für Nachschlagetabellen oder kleine Tabellen. (Vorgabe: False) (bool)

source: When True, the dialog resizes to fit the added controls. (bool)
de: Wenn True, passt sich die Größe des Dialogs den hinzugefügten Elementen an. (bool)

source: When inserting a new record, does the backend populate the PK field?
de: Setzt das Backend den Primärschlüssel für neu eingefügte Datensätze?

source: When running as a web app, this holds the host URL. (str)
de: Beim Einsatz als Web-Anwendung enthält dies die URL des Hosts. (str)

source: When the panel's Close button is clicked, does the panel get destroyed (True) or just hidden (False, default) (bool)
de: Soll das Panel zerstört (True) oder nur versteckt (False, standard) werden, wenn der Schließen-Knopf gedrükt wird? (bool)

source: Whether or not nulls are allowed. Default:True (bool)
de: Gibt an, ob Nullwerte erlaubt sind. Vorgabe:True (bool)

source: Whether or not the field has the primary key. (bool)
de: Gibt an, ob das Feld Primärschlüssel ist. (bool)

source: Whether or not the field is an auto incrementing field. Default:False (bool)
de: Gibt an, ob dieses Feld ein autoincrement Feld ist. (Vorgabe:False) (bool)

source: Whether or not the table is temporary. (bool)
de: Gibt an, ob dies eine temporäre Tabelle ist. (bool)

source: Width of the panel when floating (int)
de: Breite des Panels, wenn schwebend. (int)

source: Width of the wizard icon in pixels (int)
de: Breite des Wizard Icons in Pixel (int)

source: Wizard Page
de: Wizard-Seite

source: Write-only property that encrypts the value and stores that in the Password property. (str)
de: Write-only Eigenschaft zum Encrypten und Speichern des Wertes des Passwortfeldes. (str)

source: You cannot move forward if this textbox is empty
de: Bei leerem Textfeld kann nicht weiter gemacht werden.

source: You do not have the database module for %s installed
de: Sie haben das Modul für die Datenbank %s nicht installiert

source: You must enter the password first.
de: Sie müssen zuerst ein Passwort eingeben.

source: You must enter the username first.
de: Sie müssen zuerst einen Benutzernamen eingeben.

source: You should only see this if you did not check the box on Page Two.
de: Dies sollten sie nur sehen, wenn sie die Checkbox auf Seite 2 nicht aktiviert haben

source: Zoom &In
de: Ver&größern

source: Zoom &Out
de: Ver&kleinern

source: Zoom In
de: Vergrößern

source: Zoom Out
de: Verkleinern

source: _correctFieldType() failed for field: '%s'; value: '%s'; type: '%s'
de: _correctFieldType() fehlgeschlagen für Feld: '%s'; Wert: '%s'; Typ: '%s'

source: added
de: hinzugefügt

source: and
de: und

source: bizobj for data source %s does not exist.
de: bizobj für Datenquelle %s existiert nicht.

source: checkPK failed; no primary key specified
de: checkPK fehlgeschlagen; Kein Primärschlüssel angegeben.

source: does not exist in the data set
de: ist im Data Set nicht vorhanden

source: getShortDataType - unknown type: %s
de: getShortDataType - unbekannter Datentyp: %s

source: setAfter() failed to set property '%s' to value '%s': %s.
de: Setzen der Eigenschaft '%s' auf den Wert '%s' in setAfter() nicht möglich: %s.

source: setAfterInterval() failed to set property '%s' to value '%s': %s.
de: Setzen der Eigenschaft '%s' auf den Wert '%s' in setAfterInterval() nicht möglich: %s.

source: warning: on page %s: not enough chars rendered, diff: %s
de: Warnung: Auf Seite %s wurden nicht genügend Zeichen dargestellt, Unterschied: %s
