Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: Characters that define the type of input that the control will accept. (str) These are the available input codes and their meaning: =============================================== Character Meaning =============================================== # Allow numeric only (0-9) _ Allow spaces ! Force upper ^ Force lower R Right-align field(s) r Right-insert in field(s) (implies R) < Stay in field until explicit navigation out of it > Allow insert/delete within partially filled fields (as opposed to the default "overwrite" mode for fixed-width masked edit controls.) This allows single-field controls or each field within a multi-field control to optionally behave more like standard text controls. (See EMAIL or phone number autoformat examples.) *Note: This also governs whether backspace/delete operations shift contents of field to right of cursor, or just blank the erased section. Also, when combined with 'r', this indicates that the field or control allows right insert anywhere within the current non-empty value in the field. (Otherwise right-insert behavior is only performed to when the entire right-insertable field is selected or the cursor is at the right edge of the field.* , Allow grouping character in integer fields of numeric controls and auto-group/regroup digits (if the result fits) when leaving such a field. (If specified, .SetValue() will attempt to auto-group as well.) ',' is also the default grouping character. To change the grouping character and/or decimal character, use the groupChar and decimalChar parameters, respectively. Note: typing the "decimal point" character in such fields will clip the value to that left of the cursor for integer fields of controls with "integer" or "floating point" masks. If the ',' format code is specified, this will also cause the resulting digits to be regrouped properly, using the current grouping character. - Prepend and reserve leading space for sign to mask and allow signed values (negative #s shown in red by default.) Can be used with argument useParensForNegatives (see below.) 0 integer fields get leading zeros D Date[/time] field T Time field F Auto-Fit: the control calulates its size from the length of the template mask V validate entered chars against validRegex before allowing them to be entered vs. being allowed by basic mask and then having the resulting value just colored as invalid. (See USSTATE autoformat demo for how this can be used.) S select entire field when navigating to new field
de: Zeichen, welche die Art der Eingabe definieren, die das Element akzeptieren soll. (str) Dies sind die zulässigen Eingabe-Codes und ihre Bedeutung: =============================================== Zeichen Bedeutung =============================================== # nur Ziffern erlaubt (0-9) _ Leerzeichen erlaubt ! erzwinge Großschreibung ^ erzwinge Kleinschreibung R Feld(er) rechtsbündig ausrichten r in Felder auf der rechten Seite einfügen (impliziert R) < im Feld bleiben, bis explizit hinaus navigiert wird > einfügen/löschen innerhalb teilweise ausgefüllter Felder erlauben (im Gegensatz zum standardmäßigen Überschreibe-Modus für maskierte Eingabeelemente mit fester Breite). Dadurch verhalten sich Einzelfeld-Elemente oder jedes Feld eines Mehrfeld-Elements ähnlich wie Standard-Texteingabeelemente. (Siehe Beispiele zu Email oder Telefonnummer.) Achtung, dies bestimmt auch, ob der Feldinhalt beim Löschen rechts vom Cursor verschoben wird oder die gelöschte Stelle nur geleert wird. Kombiniert mit "r" bedeutet dies, dass das Feld überall das Einfügen auf der rechten Seite erlaubt. Ansonsten wird das Rechts-Einfügen nur ausgeführt, wenn das ganze Feld markiert ist oder der Cursor auf der rechten Seite des Feldes steht. , Tausender-Trennzeichen und automatische Gruppierung in Integer-Feldern ermöglichen, sobald das Feld verlassen wird. (Wenn angegeben, wird auch .SetValue() die Gruppierung versuchen.) "," ist außerdem das Vorgabe-Gruppentrennzeichen. Um es zu ändern, setze die Parameter groupChar (Tausender-Trennzeichen) und/oder decimalChar (Dezimal-Trennzeichen). Achtung, wenn in solchen Feldern das Dezimal-Trennzeichen eingegeben wird, werden die übrigen Stellen gruppiert. - Platz für das Vorzeichen frei lassen und Werte mit Vorzeichen erlaubrn (negative Werte werden per Vorgabe rot geschrieben). Kann zusammen mit useParensForNegatives verwendet werden (siehe unten). 0 Integer-Felder mit führenden Nullen. D Datums-(und Zeit-)Feld T Zeit-Feld F Automatische Größenanpassung: Das Element berechnet seine Größe aus der Länge der Maske. V eingegebene Zeichen gegen validRegex validieren, bevor sie zugelassen werden im Gegensatz zur normalen Maske, wo sie eingegeben werden können und nur der Wert als unzulässig eingefärbt wird. (Siehe Demo zum US-State zur Verwendung.) S Ganzes Feld markieren, wenn es den Fokus bekommt.

source: Check every...
de: Regelmäßig suchen...

source: Check for framework updates
de: Nach Aktualisierung des Dabo-Frameworks suchen

source: Check now...
de: Jetzt suchen...

source: Child controls of this panel. This excludes the wx-specific scroll bars (list of objects)
de: Von diesem Panel abhängige Elemente. Die wx-spezifischen Scrollbalken wurden weggelassen. (Liste von Objekten)

source: Choose a file
de: Datei auswählen

source: Choose a folder
de: Wählen Sie einen Ordner

source: Class file '%s' not found
de: Klassendatei '%s' nicht gefunden

source: Class to instantiate for the application's preference editing (dForm/dDialog)
de: Klasse, die für die Bearbeitung der Voreinstellungen der Anwendung instanziiert werden soll (dForm/dDialog)

source: Class to instantiate when a change to ColumnCount requires additional columns to be created. Default=dColumn. (dColumn subclass)
de: Klasse, die instantiiert wird, wenn eine Änderung an ColumnCount (Anzahl der Spalten) erfordert, dass zusätzliche Spalten erzeugt werden. Vorgabe=dColumn. (Von dColumn abgeleitete Klasse)

source: Class to use for the border sizer. Default=dabo.ui.dBorderSizer (dSizer)
de: Klasse für die Rahmen-Sizer. (Vorgabe=dabo.ui.dBorderSizer) (dSizer)

source: Class to use for the radio buttons. Default=_dRadioButton (dRadioButton)
de: Klasse für die Radiobuttons (Vorgabe=_dRadioButton) (dRadioButton)

source: Class to use when creating nodes (dNode)
de: Klasse für neue Knoten (dNode)

source: Class used for creating panels. If the class does not descend from SplitterPanelMixin, that class will be mixed-into the class specified here. This must be set before the panels are created; setting it afterward has no effect unless you destroy the panels and re-create them. Default=dPanel (dPanel)
de: Klasse, die zum Erzeugen von Panels verwendet wird. Wenn die Klasse nicht von SplitterPanelMixin erbt, wird diese Klasse hier eingemischt. Dies muss definiert werden, bevor Panels erzeugt werden; es später zu setzen hat keinen Effekt, wenn Sie die Panels nicht zerstören und neu erzeugen. Vorgabe=dPanel (dPanel)

source: Clear
de: Löschen

source: Clear Key
de: Taste löschen

source: Clear O&utput
de: O& Ausgabe löschen

source: Clear Output Window
de: Ausgabefenster löschen

source: Close Borderless Form
de: Rahmenloses Formular schließen

source: Close Windo&w
de: Fenster Schliessen

source: Close the current window
de: Aktuelles Fenster schließen

source: Color for the background of each cell in the column.
de: Hintergrundfarbe für jede Zelle dieser Spalte

source: Color for the background of the current cell in the column.
de: Hintergrundfarbe der aktuellen Zelle in der Spalte

source: Color for the foreground (text) of each cell in the column.
de: Vordergrundfarbe (Text) jeder Zelle dieser Spalte

source: Color for the foreground (text) of the current cell in the column.
de: Vordergrundfarbe (Text) der aktuellen Zelle in der Spalte

source: Color of text when using text objects (str or tuple)
de: Textfarbe von Text-Objekten (str oder tuple)

source: Color of the box background (str or tuple)
de: Hintergrundfarbe der Box (str oder tuple)

source: Color of the button background when mouse is hovered over control (str or tuple) Default=(128, 128, 128) Changing this color with change the color of the control when pressed as well.
de: Hintergrundfarbe des Buttons, wenn die Maus darüber steht (str oder tuple) Vorgabe=(128, 128, 128) Diese Farbe wird auch für den gedrückten Button verwendet.

source: Color of the link when the mouse passes over it. (str or tuple)
de: Farbe des Links, wenn die Maus darüber steht (str oder tuple)

source: Color of visited links (str or tuple)
de: Farbe für besuchte Links (str oder tuple)

source: Column %s
de: Spalte %s

source: Column to be sorted when sort() is called. Default=0 (int)
de: Spalte, die sortiert werden soll, wenn sort() aufgerufen wird (Vorgabe=0) (int)

source: Command Win&dow
de: Kommandofenster

source: Connection Lost exception encountered in saverow(): %s
de: Connection Lost exception aufgetreten in saverow(): %s

source: Connection to database was lost.
de: Verbindung zur Datenbank verloren.

source: Containing sizer did not match item %s
de: Der umgebende Sizer passt nicht zum Element %s

source: Contains a reference to the active control on the form, or None.
de: Enthält einen Verweis auf das aktive Element des Formulars oder None.

source: Contains an object reference to the containing toolbar.
de: Enthält eine Referenz auf die übergeordnete Werkzeugleiste.

source: Control which is currently managing this window. (varies)
de: Element, das derzeit dieses Fenster verwaltet. (verschieden)

source: Controls if a newline adds the previous line's indentation (bool)
de: Steuert, ob eine neue Zeile die Einrückung der vorigen erhält (bool)

source: Controls if the user has to press 'Enter/Tab' to accept the AutoComplete entry (bool)
de: Kontrolliert, ob der Benutzer 'Enter/Tab' drücken muss, um den AutoComplete-Eintrag zu übernehmen. (bool)

source: Controls the bold setting of the box caption (bool)
de: Kontrolliert die Fettschrift-Einstellung für die Titelzeile der Box (bool)

source: Controls the italic setting of the box caption (bool)
de: Kontrolliert die Kursivschrift-Einstellung für die Titelzeile der Box (bool)

source: Controls the minimum width/height of the panels. (int)
de: Bestimmt die minimale Breite/Höhe der Panels (int)

source: Controls the spacing of the items in the controlling list (int)
de: Bestimmt den Abstand der Einträge in der kontrollierenden Liste (int)

source: Controls the type face of the box caption (str)
de: Definiert die Schriftart für die Titelzeile der Box (str)

source: Controls the underline setting of the box caption (bool)
de: Kontrolliert die Unterstrichen-Einstellung für die Titelzeile der Box (bool)

source: Controls whether fonts are anti-aliased (default=True) (bool)
de: Bestimmt, ob Schriftarten geglättet dargestellt werden sollen (Vorgabe=True) (bool)

source: Controls whether text lines that are wider than the window are soft-wrapped or clipped. (bool)
de: Bestimmt, ob Textzeilen, die breiter sind als das Fenster, umbrochen oder abgeschnitten werden sollen (bool)

source: Controls whether the button resizes when the Picture changes. (bool)
de: Legt fest, ob die Knopfgröße angepasst werden muss, wenn das Bild wechselt. (bool)

source: Controls whether the column is shown or not (bool)
de: Kontrolliert, ob die Spalte angezeigt werden soll oder nicht (bool)

source: Controls whether the output is in a separate pane (default) or intermixed with the commands. (bool)
de: Bestimmt, ob die Ausgabe eine eigenen Bereich bekommt (Vorgabe) oder ob sie mit den Kommandos vermischt ausgegeben wird (bool)

source: Controls whether the shape is drawn. (bool)
de: Bestimmt, ob die Form gezeichnet wird (bool)

source: Controls whether the title text is bold. (bool)
de: Steuert, ob Titelzeile in fett darzustellen ist (bool)

source: Controls whether the title text is italic. (bool)
de: Steuert, ob Titelzeile in kursiv darzustellen ist. (bool)

source: Controls whether this object will scroll horizontally (default=True) (bool)
de: Bestimmt, ob dieses Objekt waagerecht rollen kann (Vorgabe=True) (bool)

source: Controls whether this object will scroll vertically (default=True) (bool)
de: Bestimmt, ob dieses Objekt senkrecht rollen kann (Vorgabe=True) (bool)

source: Convenience property, equivalent to (Width, Height) (2-tuple)
de: Bequeme Abkürzung, gleichwertig zu (Width, Height) (2-tuple)

source: Cool sizer visualizing feature; check it out!
de: Tolle Funktion, um Sizer sichtbar zu machen; probier's aus!

source: Copy
de: Kopieren

source: Copy Info
de: Informationen kopieren

source: Copy selected text
de: Kopiert ausgew&ählten Text

source: Could not access the database with the given username and password.
de: Mit dem angegebenen Benutzernamen und Passwort konnte nicht auf die Datenbank zugegriffen werden.

source: Could not connect to the Dabo servers
de: Keine Verbindung zum Dabo-Server

source: Could not establish connection '%s'
de: Konnte Verbindung '%s' nicht aufbauen

source: Could not evaluate method '%s': %s
de: Konnte Methode '%s' nicht auswerten: %s

source: Could not find a button with Caption of '%s'
de: Es konnte kein Button mit der Aufschrift '%s' gefunden werden

source: Could not open %s. Please check that you have read permissions.
de: Konnte %s nicht öffnen. Bitte stellen Sie sicher, dass Sie Leserechte haben.

source: Could not open file: '%(val)s': %(e)s
de: Konnte die Datei nicht öffnen: '%(val)s': %(e)s

source: Could not save file '%s'. Please check your write permissions.
de: Konnte die Datei '%s' nicht speichern. Bitte überprüfen Sie Ihre Schreibrechte.

source: Could not set value of %s to %s. Error message: %s
de: Konnte den Wert von %s nicht auf %s setzen. Fehlermeldung: %s

source: Could not setup the database. Access was denied.
de: Datenbank konnte nicht erzeugt werden. Zugriff wurde verweigert.

source: Cu&t
de: A&usschneiden

source: Current Key:
de: Aktuelle Taste:

source: Current contents of the editor (str)
de: Aktueller Inhalt des Editors (str)

source: Current number of rows in the recordset. Read-only.
de: Aktuelle Anzahl Zeilen im Recordset. (Read-Only)

source: Current row in the recordset.
de: Aktuelle Zeile im Recordset

source: Currently only %s are supported
de: Momentan werden nur %s unterstützt

source: Currently selected column index. (int)
de: Index der ausgewählten Spalte (int)

source: Currently selected row (int)
de: Ausgewählte Zeile (int)

source: Currently selected text. Returns the empty string if nothing is selected (str)
de: Ausgewählter Text. Leerer String, wenn nichts ausgewählt ist (str)

source: Custom Editor class for this column. Default: None. Set this to override the default editor class, which Dabo will select based on the data type of the field.
de: Eigene Editor-Klasse für diese Spalte. (Vorgabe: None) Überschreibe hiermit die Vorgabe-Klasse für den Editor, die Dabo sonst je nach Datentyp des Feldes auswählt.

source: Custom Renderer class for this column. Default: None. Set this to override the default renderer class, which Dabo will select based on the data type of the field.
de: Eigene Renderer-Klasse für diese Spalte. (Vorgabe: None) Überschreibe hiermit die Vorgabe-Klasse für den Renderer, die Dabo sonst je nach Datentyp des Feldes auswählt.

source: Cut selected text
de: Ausgew&ählten Text ausschneiden

source: DBA, please enter the username and password that has access to create tables for database on server '%s' and database '%s'
de: Bitte Username und Passwort für den Zugriff zur Erzeugung der Tabellen für die Datenbank auf Server '%s' und Datenbank '%s' eingeben

source: DBQueryException encountered in save(): %s
de: DBQueryException aufgetreten in save(): %s

source: DEPRECATED. Equivalent to UserSQL. (str)
de: AUSLAUFEND. Entspricht UserSQL.

source: Dabo has been updated to revision %s. The app will now exit. Please re-run the application.
de: Dabo wurde auf Version %s aktualisiert. Das Programm wird jetzt beendet. Bitte starten Sie es erneut.

source: Data Connection Lost
de: Datenverbindung nicht mehr vorhanden

source: DataSource '%s' does not inherit from a proper Dabo class. This may result in unsupported problems.
de: Die Datenquelle '%s' ist nicht von einer geeigneten Dabo-Klasse abgeleitet. Das kann zu Problemen führen, für die kein Support angeboten wird.

source: Database Action Failed
de: Datenbankaktion fehlgeschlagen

source: Database Execution failed with response: %s
de: Die Datenbank-Abfrage ist mit folgender Antwort fehlgeschlagen: %s

source: Database Query Exception: %s.
de: Ausnahme bei der Datenbank-Abfrage: %s

source: Database file '%s' does not exist
de: Datenbank-Datei '%s' existiert noch nicht

source: Dataset containing the command history (dDataSet)
de: Datensatz, der die Befehls-Geschichte enthält (dDataSet)

source: De&bug Output Window
de: De&bugger-Ausgabe-Fenster

source: Deactivate
de: Deaktivieren

source: Debug Output
de: Debuggerausgabe

source: Decrease Font Size
de: Schriftgrösse verkleinern

source: Default ToolTip for the Tree
de: Vorgabe-Tooltip for den Baum

source: Default sizer class for pages added automatically to this control. Set this to None to prevent sizers from being automatically added to child pages. (dSizer or None)
de: Vorgabe-Sizer-Klasse für Seiten, die diesem Element automatisch hinzugefügt werden.

source: Defines x axis type. Can be 'none', 'min' or 'auto' where: 'none' - shows no axis or tick mark values 'min' - shows min bounding box values 'auto' - rounds axis range to sensible values
de: Bestimmt die Art der x-Achse. Kann die Werte 'none', 'min' oder 'auto' annehmen. 'none': Achse oder Skala werden nicht angezeigt 'min': Achse mit minimaler Bandbreite 'auto': rundet die Achsen-Bandbreite auf vernünftige Werte

source: Delete
de: Löschen

source: Delete All failed with response: %s
de: Alle Löschen fehlgeschlagen mit der Meldung: %s

source: Delete failed with response: %s
de: Löschen fehlgeschlagen mit der Antwort: %s

source: Delete the current record from the dataset.
de: Löschen des aktuellen Datensatzes der Selektion

source: Delete this record
de: Den Datensatz löschen

source: Deletion Not Allowed
de: Löschung nicht erlaubt

source: Deletion prohibited - there are related child records.
de: Löschen verboten - es sind zugehörige Detaildatensätze vorhanden.

source: Description of the data type for this column (str)
de: Beschreibung des Datentyps für diese Spalte (str)

source: Designates the column to expand to fill the control when ExpandToFit is True. Can either be an integer specifying the column number, or the string 'LAST' (default), which will expand the rightmost column. (int or str)
de: Bestimmt die Spalte, die expandiert werden soll, wenn ExpandToFit wahr (True) ist. Kann entweder ein Integer sein, der die Spalten-Nummer bezeichnet oder der String 'LAST' (Vorgabe), was die erste Spalte von rechts bezeichnet. (int oder str)

source: Deterimnes if indentation guides are displayed (default=False) (bool)
de: Bestimmt, ob die Einzugs-Linien angezeigt werden. Vorgabe=False (bool)

source: Determines how the grid displays selections. (str) Options are: Cells/Plain/None - no row/col highlighting (default) Row - the row of the selected cell is highlighted Column - the column of the selected cell is highlighted The highlight color is determined by the SelectionBackColor and SelectionForeColor properties.
de: Bestimmt, wie das Grid die Auswahl anzeigt. (str) Gültige Optionen sind: Cells/Plain/None (Vorgabe) Row – die Zeile der ausgewählten Zelle ist markiert Column – die Spalte der ausgewählten Zelle ist markiert Die Markierungsfarbe wird durch die Eigenschaften SelectionBackColor und SelectionForeColor bestimmt.

source: Determines how the image responds to sizing. Can be one of the following: Clip: Only that part of the image that fits in the control's size is displayed Proportional: the image resizes to fit the control without changing its original proportions. (default) Stretch: the image resizes to the Height/Width of the control.
de: Bestimmt, wie das Bild auf Größenänderungen reagiert. Gültige Optionen sind: Clip: Nur der Teil des Bildes, der in die Größe des Elements passt, wird angezeigt Proportional: Das Bild wird proportional skaliert, dass es das Element ausfüllt. (Vorgabe) Stretch: Das Bild wird auf die Breite und Höhe des Elements verzerrt.

source: Determines if auto-completion pops up without a special trigger key (bool)
de: Bestimmt, ob die automatische Vervollständigung ohne besondere Auslösetaste angezeigt wird. (bool)

source: Determines if call tips are shown (default=True) (bool)
de: Bestimmt, ob Popup-Hinweise (call tips) angezeigt werden. Vorgabe=True. (bool)

source: Determines if code completion is active (default=True) (bool)
de: Legt fest, ob Codevervollständigung aktiv ist (default=True) (bool)

source: Determines if end-of-line markers are visible (default=False) (bool)
de: Bestimmt, ob Zeilenende-Zeichen angezeigt werden. Vorgabe=False. (bool)

source: Determines if grid lines are shown (default=False) (bool)
de: Bestimmt, ob Raster-Linien angezeigt werden. Vorgabe=False. (bool)

source: Determines if line numbers are shown in the left margin (default=True) (bool)
de: Bestimmt, ob Zeilennummern im linken Rand angezeigt werden. Vorgabe=True. (bool)

source: Determines if scientific notation is used for the display (default=False) (bool)
de: Bestimmt, ob die wissenschaftliche Notation (Exponentenschreibweise) verwendet wird. Vorgabe=False. (bool)

source: Determines if scrollbars are shown (default=False) (bool)
de: Bestimmt, ob Rollbalken angezeigt werden. Vorgabe=False. (bool)

source: Determines if sizer outlines are drawn on the ActiveForm. (bool)
de: Legt fest, ob Sizer Outlines[Umrisse] auf die ActiveForm gezeichnet werden. (bool)

source: Determines if syntax coloring is used (default=True) (bool)
de: Bestimmt, ob farbige Syntax-Hervorhebungen verwendet werden. Vorgabe=True. (bool)

source: Determines if the Caption is show (default=True) (bool)
de: Bestimmt, ob die "Caption" angezeigt wird. Vorgabe=True. (bool)

source: Determines if the Split/Unsplit context menu is shown (default=True) (bool)
de: Bestimmt, ob das Kontextmenü Teilen/Zusammenfügen (Split/Unsplit) angezeigt wird. Vorgabe=True. (bool)

source: Determines if the code folding symbols are displayed in the left margin (default=True) (bool)
de: Bestimmt, ob die Symbole zum Code-Einfalten im linken Rand angezeigt werden. Vorgabe=True. (bool)

source: Determines if the default context menu for split/unsplit is enabled for the panels (default=False) (bool)
de: Bestimmt, ob das Standard-Kontextmenü zum teilen/zusammenfügen für die Panels aktiviert ist. Vorgabe=False (bool)

source: Determines if the dialog is displayed centered on the screen. (bool)
de: Bestimmt, ob der Dialog in der Mitte des Bildschirms zentriert wird (bool)

source: Determines if the dialog is shown modal (default) or modeless. (bool)
de: Bestimmt, ob der Dialog modal (standard) oder unmodal angezeigt wird. (bool)

source: Determines if the legend is shown (default=False) (bool)
de: Bestimmt, ob die Legende angezeigt wird. Vorgabe=False (bool)

source: Determines if the point labels are shown (bool)
de: Bestimmt, ob die Punkt-Bezeichnungen angezeigt werden (bool)

source: Determines if the user can add new entries to the list (bool)
de: Ermittelt, ob der Benutzer neue Einträge zur Liste anlegen darf (bool)

source: Determines if the user can change existing entries (bool)
de: Legt fest, ob der User bestehende Einträge ändern kann (bool)

source: Determines if the user can delete entries from the list (bool)
de: Ermittelt, ob der Benutzer Einträge der Liste löschen darf (bool)

source: Determines if the user can re-order items (bool)
de: Ermittelt, ob der Benutzer Einträge umsortieren darf (bool)
