Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: Determines if the window splits Horizontally or Vertically. (str)
de: Bestimmt, ob das Fenster horizontal oder vertikal geteilt wird. (str)

source: Determines if the window splits Horizontally or Vertically. (string)
de: Bestimmt, ob das Fenster horizontal oder vertikal geteilt wird. (str)

source: Determines if we are using a table that auto-generates its PKs. (bool)
de: Gibt an, ob eine Tabelle mit automatisch generiertem Primärschlüssel verwendet wird. (bool)

source: Determines if we change the case of entered text. Possible values are: None, "" (empty string): No changes made (default) "Upper": FORCE TO UPPER CASE "Lower": force to lower case "Title": Force To Title Case These can be abbreviated to "u", "l" or "t" (str)
de: Bestimmt, ob wir die Groß-/Kleinschreibung von eingegebenem Text ändern. Gültige Optionen sind: None, "" (leerer String): Keine Änderungen (Vorgabe) "Upper": VERSALIEN werden erzwungen "Lower": kleinbuchstaben werden erzwungen "Title": Der Erste Buchstabe Im Wort Wird Groß Diese Optionen können als "u", "l" oder "t" abgekürzt werden. (str)

source: Determines if white space characters are displayed (default=True) (bool)
de: Bestimmt, ob Symbole für unsichtbare Zeichen (Whitespace) angezeigt werden. Vorgabe=True (bool)

source: Determines whether drag is enabled (bool)
de: Bestimmt, ob das Ziehen aktiviert ist. (bool)

source: Determines whether each axis is on a logscale (tuple)
de: Bestimmt, ob jede Achse logarithmisch skaliert wird. (tuple)

source: Determines whether holidays are displayed as highlighted. Default=False. (bool)
de: Sollen Feiertage als markiert angezeigt werden? Standard=False (bool)

source: Determines whether the pane is floating (False) or docked (True) (bool)
de: Legt fest, ob das Panel schwebt (False) oder angedockt ist (True). (bool)

source: Determines whether the pane is floating (True) or docked (False) (bool)
de: Bestimmt, ob das Panel schwebt (True) oder angedockt ist (False). (bool)

source: Determines whether zoom is enabled
de: Bestimmt, ob das Zoomen aktiviert ist.

source: Determines which language is used for the syntax coloring (str)
de: Bestimmt, welche Sprache für die Syntax-Hervorhebung verwendet wird. (str)

source: Dialogs cannot have both 'OK' and 'Yes' buttons.
de: Dialoge können nicht gleichzeitig 'OK und 'Ja'-Knöpfe haben.

source: Dictionary of custom editors for this column. Default: {}. Set this to override the default editor class on a row-by-row basis. If there is no custom editor class for a given row in CustomEditors, the CustomEditor property setting will apply.
de: Dictionary der eigenen Editoren für diese Spalte. Vorgabe={} Hiermit kann man die Standard-Editoren Zeile für Zeile überschreiben. Wenn CustomEditors keinen eigenen Editor für eine bestimmte Zeile enthält, wird die Eigenschaft CustomEditor angewendet.

source: Dictionary of custom list choices for this column. Default: {}. Set this to override the default list choices on a row-by-row basis. If there is no custom entry for a given row in CustomListEditorChoices, the ListEditorChoices property setting will apply.
de: Dictionary eigener Listen-Einträge für diese Spalte. Vorgabe: {} Hiermit kann man die Stadard-Auswahlliste für einzelne Zeilen ändern. Wenn es für eine bestimmte Zeile in CustomListEditorChoices keinen eigenen Eintrag gibt, wird die Eigenschaft ListEditorChoices angewendet.

source: Dictionary of custom renderers for this column. Default: {}. Set this to override the default renderer class on a row-by-row basis. If there is no custom renderer for a given row in CustomRenderers, the CustomRendererClass property setting will apply.
de: Dictionary eigener Renderer für diese Spalte. Vorgabe: {} Hiermit kann man die Standard-Renderer-Klasse für einzelne Zeilen ändern. Wenn es für eine bestimmte Zeile in CustomRenderers keinen eigenen Renderer gibt, wird die Eigenschaft CustomRendererClass angewendet.

source: Dictionary of data name/value pairs associated with the event. (dict)
de: Dictionary der zugehörigen Name/Wert Paare des Events. (dict)

source: Did the skipping work OK?
de: Hat das Überspringen geklappt ?

source: Direction of the drawn gradient ('v' or 'h') (str)
de: Richtung des Verlaufs ('v'ertikal oder 'h'orizontal). (str)

source: Display Mask for the control. (str) These are the allowed mask characters and their function: =============================================== Character Function =============================================== # Allow numeric only (0-9) N Allow letters and numbers (0-9) A Allow uppercase letters only a Allow lowercase letters only C Allow any letter, upper or lower X Allow string.letters, string.punctuation, string.digits & Allow string.punctuation only (doesn't include all unicode symbols) * Allow any visible character | explicit field boundary (takes no space in the control; allows mix of adjacent mask characters to be treated as separate fields, eg: '&|###' means "field 0 = '&', field 1 = '###'", but there's no fixed characters in between. =============================================== Repetitions of the same mask code can be represented by placing the number of repetitions in curly braces after the code. E.g.: CCCCCCCC = C{6}
de: Anzeigemaske für das Element. (str) Dies sind die zulässigen Masken-Zeichen und ihre Funktion: =============================================== Zeichen Funktion =============================================== # nur Ziffern (0-9) N Buchstaben und Ziffern (0-9) A nur Großbuchstaben a nur Kleinbuchstaben C alle Buchstaben (groß oder klein) X nur string.letters, string.punctuation, string.digits & nur string.punctuation (enthält nicht alle Unicode-Satzzeichen) * alle sichtbaren Zeichen | explizite Feldgrenze; nimmt keinen Raum im Eingabefeld ein, erlaubt es, dass benachbarte, gleiche Masken-Zeichen als einzelne Felder behandelt werden (z.B.: '&|###' bedeutet "Feld 0 = '&', Feld 1 = '###'"), ohne dass ein festes Zeichen zwischen ihnen steht. =============================================== Wiederholungen des gleichen Masken-Zeichens können durch die Anzahl in geschweiften Klammern ersetzt werden, z.B. CCCCCCCC = C{6}

source: Do property assignments automatically save themselves? Default=True (bool)
de: Sollen Vorgabeeinstellungen automatisch gespeichert werden? Vorgabe=True (bool)

source: Do we requery child bizobjs after a save()? (bool)
de: Sollen abhängige Geschäftsobjekte nach dem Speichern neu abgefragt werden? (bool)

source: Do we scan the records in reverse order? (Default: False) (bool)
de: Sollen Datensätze in umgekehrter Reihenfolge abgesucht werden? (Vorgabe: False) (bool)

source: Do you wish to pass?
de: Möchten Sie das übergehen?

source: Do you wish to save your changes?
de: Wollen Sie die Änderungen speichern?

source: Does the 'Advanced' button appear in the Quick Report dialog?
de: Soll der "Experten"-Button auf dem Kurzbericht- Dialog erscheinen ?

source: Does the focus go to the browse grid when the browse page is entered?
de: Soll der Focus zum Browse-Grid wechseln, wenn die Browse-Seite gewählt wird ?

source: Does the link show the hover effect? (bool)
de: Zeigt der Link einen Hover-Effekt? (bool)

source: Does the panel display a close button when floating? Default=True (bool)
de: Zeigt das Panel einen Close-Button wenn nicht angedockt ?Default=True (bool)

source: Does the panel display a draggable gripper? Default=False (bool)
de: Zeigt das Panel einen ziehbaren Anfasser? Standard=False (bool)

source: Does the panel display a maximize button when floating? Default=False (bool)
de: Zeigt das Panel einen Maximieren-Knopf, wenn nicht angedockt? Standard=False (bool)

source: Does the panel display a minimize button when floating? Default=False (bool)
de: Zeigt das Panel einen Minimieren-Knopf, wenn nicht angedockt? Standard=False (bool)

source: Does the panel display a pin button when floating? Default=False (bool)
de: Zeigt das Panel einen Pin-Button wenn nicht angedockt ?Default=False (bool)

source: Does this column expand/shrink as the grid width changes? Default=False (bool)
de: Wird diese Spalte erweitert/geschrumpft, wenn das Grid verändert wird? Vorgabe=False (bool)

source: Does this form update the status text with the current record position? (bool)
de: Aktualisiert dieses Formular den Status-Text mit der aktuellen Datensatz-Position? (bool)

source: Does this panel use double-buffering to create smooth redrawing? (bool)
de: Verwendet dieses Panel doppelte Pufferung, um ein flüssiges Neuzeichnen zu erzeugen? (bool)

source: Duplicate Keystroke
de: Doppelter Tastenanschlag

source: Duplicate RegID '%s' found
de: Doppelte RegID '%s' gefunden

source: Dynamically determine the value of the %s property. Specify a function and optional arguments that will get called from the update() method. The return value of the function will get set to the %s property. If Dynamic%s is set to None (the default), %s will not be dynamically evaluated.
de: Bestimme den Wert der Eigenschaft %s dynamisch. Definieren Sie eine Funktion (und optional Parameter), die von der update()-Methode aufgerufen werden soll. Der Rückgabewert dieser Funktion wird der Eigenschaft %s zugewiesen. Wenn Dynamic%s auf None gesetzt ist (Vorgabe), wird %s nicht dynamisch ausgewertet.

source: Edit
de: Bearbeiten

source: Edit the fields of the currently selected record.
de: Editieren der Felder des momentan ausgewählten Datensatztes.

source: Edit this record
de: Datensatz bearbeiten

source: Empty Event Binding: Object: %s; Event: %s
de: Leere Ereignis-Bindung: Objekt: %s, Event: %s

source: Encoding type used by the Backend (string)
de: Der vom Backend verwendete Kodierungtyp (string)

source: End of line characters. Allowed values are 'CRLF', 'LF' and 'CR'. (default=os dependent) (str)
de: Zeilenumbruch-Zeichen. Zulässig sind 'CRLF', 'LF' und 'CR'. (Vorgabe ist betriebssystemabhängig) (str)

source: Enter an integer value:
de: Bitte Zahlenwert eingeben:

source: Error importing OpenGL: %s
de: Fehler beim Import von OpenGL: %s

source: Error importing numpy.oldnumeric: %s
de: Fehler beim Importieren von numpy.oldnumeric: %s

source: Error in scanChangedRows: %s
de: Fehler in scanChangedRows: %s

source: Error setting font for %s
de: Fehler beim Setzen der Schriftart auf %s

source: Error setting value to '%(uStrVal)s: %(e)s
de: Fehler beim Setzen des Wertes auf '%(uStrVal)s: %(e)s

source: Every time an app is run
de: Jedes Mal, wenn die Anwendung gestartet wird

source: Exit the application
de: Anwendung beenede

source: Extra call to unlockDisplay() for object %s
de: Zusätzlicher Aufruf von unlockDisplay() für Objekt %s

source: Extra space around the bitmap, used when auto-sizing. (int)
de: Zusätzlicher Leerraum um das Bild herum, wird bei der automatischen Größenanpassung verwendet. (int)

source: Face of the font used for text objects (str)
de: Schriftart für Text-Objekte (str)

source: Failed to create newval for field '%s'
de: Anlegen von 'newval' fur Feld '%s' fehlgeschlagen.

source: Failed to open URL '%(url)s'. Error: %(e)s
de: Konnte die URL '%(url)s' nicht öffnen. Fehler: %(e)s

source: Failed to set RowNumber. Error: %s
de: Konnte RowNumber nicht zuweisen. Fehler: %s

source: Failed to unlock display: %s
de: Konnte Display nicht aufschließen: %s

source: Field
de: Feld

source: Field %(fname)s: Incorrect unicode encoding set; using '%(enc)s' instead
de: Feld %(fname)s: Falsche Unicode Kodierung gesetzt; Benutzt wird stattdessen '%(enc)s'

source: Field '%s' does not exist in the data set.
de: Feld '%s' ist im Data Set nicht vorhanden

source: Field for the currently selected column (str)
de: Feld für die ausgewählte Spalte (str)

source: Field key in the data set to which this column is bound. (str)
de: Feld-Schlüssel in der Datenmenge, an welche diese Spalte gebunden ist. (str)

source: Fields in the cursor to be ignored during updates
de: Felder des Cursors, die bei Änderungen ignoriert werden sollen

source: Fields which comprise the index. (list)
de: Felder die zum Index gehören. (list)

source: File %s updated
de: Datei %s aktualisiert

source: File '%s' already exists. Do you want to overwrite it?
de: Die Datei »%s« existiert bereits. Möchten Sie sie ersetzen?

source: File '%s' does not exist. Would you like to create it?
de: Die Datei '%s' existiert nicht. Möchten Sie sie neu erstellen?

source: File Conflict
de: Datei-Konflikt

source: File Not Found
de: Datei nicht gefunden

source: File re-sync failed. Reason: %s
de: Datei-Synchronisation fehlgeschlagen. Grund: %s

source: Fill in the text box!!
de: Bitte einen Wert in das Textfeld eingeben!

source: Filtered copy of the History (dDataSet)
de: Gefilterte Kopie der Historie (dDataSet)

source: Find
de: Suchen

source: Find A&gain
de: Erneut Suchen

source: Find or Replace text in the active window
de: Suchen oder Ersetzen des Textes im aktiven Fenster

source: Find/Replace
de: Suchen/Ersetzen

source: Finish
de: Fertigstellen

source: First
de: Anfang

source: Flag for indicating sensitive data, such as Password field, that is not to be persisted. Default=False. (bool)
de: Marker für sensible Daten, die nicht gespeichert werden sollen, wie z.B. Kennwort-Felder. Standard=False. (bool)

source: Flag to determine if user-entered text is appended when they press 'Enter' (bool)
de: Wird vom Benutzer eingegebener Text beim Drücken von 'Enter' angehängt? (bool)

source: Font size of the axis labels (default=15) (int)
de: Schriftgröße der Achsen-Beschriftung. Vorgabe=15 (int)

source: Font size of the legend (default=7) (int)
de: Schriftgröße der Legende. Vorgabe=7 (int)

source: For circles, the radius of the shape (int)
de: Radius, falls die Form ein Kreis ist. (int)

source: For circles, the x position of the center. For rectangles, the x position of the top left corner. (int)
de: Bei Kreisen die x-Position des Mittelpunktes. Bei Rechtecken die x-Position der oberen linken Ecke. (int)

source: For circles, the y position of the center. For rectangles, the y position of the top left corner. (int)
de: Bei Kreisen die y-Position des Mittelpunktes. Bei Rechtecken die y-Position der oberen linken Ecke. (int)

source: For rectangles, the height of the shape (int)
de: Bei Rechtecken die Höhe (int)

source: For rectangles, the width of the shape (int)
de: Bei Rechtecken die Breite (int)

source: For the DB Admin: The tables must either created by: 1. using this program by TEMPORARLY giving this program access to the database to create the needed tables. 2. or executing all the quries in the 'queries.sql' file.
de: Für den DB Admin: Die Tabellen müssen erzeugt werden: 1. durch dieses Programm indem temporär Zugriff auf die Datenbank gewährt wird um die benötigten Tabellen zu erzeugen. 2. durch ausführen aller Befehle in der Datei 'queries.sql'.

source: ForeColor of selected cells (str or RGB tuple)
de: Vordergrundfarbe (ForeColor) der ausgewählten Zelle (str oder RGB-Tupel)

source: ForeColor of the shape's lines (color)
de: Vordergrundfarbe (ForeColor) des Randes (color)

source: Forecolor of the calendar header (str or tuple)
de: Vordergrundfarbe des Kalender-Kopfes (str oder tuple)

source: Forecolor of the calendar highlight (str or tuple)
de: Vordergrundfarbe der Hervorhebung im Kalender (str oder tuple)

source: Forecolor of the calendar holiday (str or tuple)
de: Vordergrundfarbe des Calendar-Feiertages (str or tuple)

source: Forecolor of the selected text. Default=black (str or tuple)
de: Vordergrundfarbe des ausgewählten Textes. Vorgabe=schwarz (str oder Tupel)

source: Foreground (text) color of this node (str, 3-tuple, or wx.Colour)
de: Vordergrund(text)farbe dieses Knotens (str, Tripel oder wx.Colour)

source: Full dot-separated string of the captions of this node and its ancestors (read-only) (str)
de: Vollständiger, Punkt-getrennter String der Beschriftungen dieses Nodes und seiner Ahnen. (read-only str)

source: Full path of the file being edited (str)
de: Vollständiger Pfad der Datei in Bearbeitung (str)

source: Function used to sort list items when Sorted=True. Default=None, which gives the default sorting (callable or None)
de: Funktion, die zum Sortieren von Listen-Einträgen verwendet wird, wenn Sorted=True. (Callable oder None) Vorgabe=None, was die Standard-Sortierung ergibt.

source: Get a new recordset from the backend.
de: Neuen Datensatz vom Backend anfordern.

source: Go to the first record
de: Auf den ersten Datensatz positionieren

source: Go to the first record in the set.
de: Gehe zum ersten Datensatz der Selektion

source: Go to the last record
de: Auf den letzten Datensatz positionieren

source: Go to the last record in the set.
de: Gehe zum letzten Datensatz der Selektion

source: Go to the next record
de: Auf den nächsten Datensatz positionieren

source: Go to the next record in the set.
de: Gehe zum nächsten Datensatz der Selektion

source: Go to the prior record
de: Auf den vorherigen Datensatz positionieren

source: Go to the prior record in the set.
de: Gehe zum vorherigen Datensatz der Selektion

source: Grid Sizers do not support insert()
de: Grid-Sizer unterstützen kein insert()

source: HTTP Error getting app list: %s
de: HTTP-Fehler beim Abrufen der Anwendungs-Liste: %s

source: HTTP Error retrieving files: %s
de: HTTP-Fehler beim Abholen von Dateien: %s

source: HTTP Error syncing files: %s
de: HTTP-Fehler beim Abgleichen der Dateien: %s

source: Has the content of this editor been modified? (bool)
de: Wurde der Inhalt dieses Editor verändert? (bool)

source: Has this link been visited? (bool)
de: Wurde dieser Link schon besucht? (bool)

source: Hatching style for the fill. (str) Options are: Solid (default) Transparent Cross Horizontal Vertical Diagonal ReverseDiagonal CrossDiagonal
de: Schraffur-Stil für die Füllung. (str) Gültige Optionen: Solid (Vorgabe) Transparent Cross Horizontal Vertical Diagonal ReverseDiagonal CrossDiagonal

source: Height of the actual displayed bitmap (int)
de: Höhe der angezeigten Bitmap (int)

source: Height of the caption bar. Read-only (int)
de: Höhe des Beschriftungsbalkens. (read-only int)

source: Height of the column headers. (int)
de: Höhe des Spaltenkopfes (int)

source: Height of the panel when floating (int)
de: Höhe des Panels, wenn nicht angedockt. (int)

source: Height of the sizer (int)
de: Höhe des Sizers (int)

source: Height of the wizard icon in pixels (int)
de: Höhe des Wizard Icons in Pixel (int)

source: Highest col position that contains any item. Read-only. (int)
de: Höchste Spalten-Position, die irgendeinen Eintrag enthält. (read-only int)

source: Highest row position that contains any item. Read-only. (int)
de: Höchste Zeilen-Position, die irgendeinen Eintrag enthält. (read-only int)

source: Horizontal alignment for all cells in this column. (str) Acceptable values are: 'Automatic': The cell's contents will align right for numeric data, left for text. (default) 'Left' 'Center' 'Right'
de: Horizontale Ausrichtung aller Zellen in dieser Spalte. (str) Gültige Werte: 'Automatic': Der Inhalt der Zelle wird für nummerische Daten rechts ausgerichtet, sonst links. (Vorgabe) 'Left' 'Center' 'Right'

source: Horizontal gap between cells in the sizer (int)
de: Waagerechter Abstand zwischen den Zellen im Sizer (int)

source: Host to use as the remote server (read-only) (str)
de: Host, der als entfernter Server verwendet werden soll (nur lesend) (str)

source: HotKey Editor
de: Editor für Tastenkürzel

source: How often does the framework check for updates?
de: Wie oft soll nach Aktualisierungen gesucht werden?

source: Html source of the current page being display. (default='') (string)
de: HTML-Quelltext der gerade angezeigten Seite. Vorgabe='' (str)

source: Human-readable description of the column's cell font settings. (str)
de: Menschen-lesbare Beschreibung der Schrifteinstellungen der Zellen dieser Spalte (str)

source: Human-readable description of the current font settings. (str)
de: Menschen-lesbare Beschreibung der aktuellen Schrifteinstellungen (str)

source: Human-readable description of the current header font settings. (str)
de: Menschen-lesbare Beschreibung der aktuellen Schrifteinstellungen des Kopfbereichs (str)

source: Human-readable description of the node's font settings. (str)
de: Menschen-lesbare Beschreibung der Schrifteinstellungen des Knotens (str)

source: Identifying value for this menu. NOTE: there is no checking for duplicate values; it is the responsibility to ensure that MenuID values are unique. (varies)
de: Bezeichner dieses Menüs. Achtung: Es wird nicht auf Eindeutigkeit geprüft; Sie sind selbst verantwortlich, dass MenuID-Werte eindeutig sind. (verschiedene)

source: Identifying value for this menuitem. NOTE: there is no checking for duplicate values; it is the responsibility to ensure that ItemID values are unique within a menu. (varies)
de: Bezeichner dieses Menüeintrags. Achtung: Es wird nicht auf Eindeutigkeit geprüft; Sie sind selbst verantwortlich, dass ItemID-Werte innerhalb des Menüs eindeutig sind. (verschiedene)

source: If True, and if the grid is set as Editable, the cell values in this column are editable by the user. If False, the cells in this column cannot be edited no matter what the grid setting is. When editable, incremental searching will not be enabled, regardless of the Searchable property setting. (bool)
de: Wenn wahr und wenn das Grid "Editable" gesetzt ist, sind die Zellen-Werte in dieser Spalte nicht vom Benutzer bearbeitbar. Wenn falsch, können die Zellen in dieser Spalte auf keinen Fall bearbeitet werden, unabhängig von den Einstellungen des Grids. Wenn "Editable" gesetzt ist, wird die inkrementelle Suche nicht aktiviert, unabhängig von der Eigenschaft "Searchable". (bool)

source: If self.EdgeGuide is set to True, specifies the column position the guide is in(int)
de: Wenn self.EdgeGuide aktiviert ist, gibt dies die Spaltenposition an, wo sich der Guide befindet. (int)

source: If self.HiliteCharsBeyondLimit is True, specifies the limiting column (int)
de: Wenn self.HiliteCharsBeyondLimit aktiviert ist, gibt dies die begrenzende Spalte an. (int)

source: If this app's source files are updated dynamically via the web, this is the base URL to which the source file's name will be appended. Default="" (i.e., no source on the internet). (str)
de: Wenn die Quelldateien dieser Anwendung dynamisch aus dem Web aktualisiert werden, ist dies die Basis-URL, an welche der Name der Quelldatei angehängt wird. Vorgabe="" (d.h. keine Quelle im Internet) (str)

source: If this bizobj is being run remotely, returns a reference to the RemoteConnector object that will handle communication with the server. (read-only) (RemoteConnector)
de: Wenn dieses Bizobj nichtlokal aufgerufen wird, gibt es eine Referenz auf das RemoteConnector-Objekt zurück, das die Kommunikation mit dem Server abhandelt. (nur lesend) (RemoteConnector)

source: If this bizobj's parent has NewChildOnNew==True, do we create a record here? (bool)
de: Wird ein neuer Datensatz erzeugt wenn das Eltern Bizobj NewChildOnNew==True gesetzt hat? (Vorgabe: False) (bool)

source: If this is a child bizobj, this represents the length of time in seconds that a subsequent requery request will be ignored. (int)
de: In einem Kind-Bizobj repräsentiert dies die Zeit in Sekunden, in der ein folgender Requery-Auftrag ignoriert wird. (int)

source: Image content for this control (binary img data)
de: Bildinhalt für dieses Element (binäre Bilddaten)

source: In the onNew() method, do we fill in the foreign key field specified by the LinkField property with the value returned by calling the bizobj's getParentPK() method? (bool)
de: Wird, in der onNew() Methode, das mit LinkField spezifizierte Feld mit dem Rückgabewert der getParentPK() Methode gefüllt? (Vorgabe: False) (bool)

source: Incorrectly-encrypted password
de: Falsch verschlüsseltes Kennwort
