Repository: biobot500/addabaji-ci
Catalog: dabo-0.9.13/dabo-0.9.13/dabo/locale/*/LC_MESSAGES/dabo.po
Languages: de

source: The connection was refused by the server. Most likely this means that the server is not running. Please have that problem corrected, and try again when it is running.
de: Die Verbindung wurde vom Server abgelehnt. Wahrscheinlich bedeutet das, dass der Server nicht läuft. Bitte behebe das Problem und versuche es noch einmal, wenn er läuft.

source: Testing super():
de: super() wird getestet:

source: Test 2: diamond inheritence test:
de: Test 2: Test der diamantförmigen Vererbung:

source: The encoding used for data in the dataset. (str)
de: Die benutzte Kodierung der Daten im DataSet. (str)

source: !!! Data Type Mismatch: field=%s. Expecting: %s; got: %s
de: !!! Falsche Datentypzuordnung: Feld=%s. Erwartet: %s; Erhalten: %s

source: "Determines how the bar containing the caption for this panel is drawn. (str) Can be one of the following: Borderless (no border, just a plain fill color; default) BorderOnly (simple border, no fill color) FilledBorder (combination of the two above) VerticalFill (vertical gradient fill, using the two caption colors) HorizontalFill (horizontal gradient fill, using the two caption colors)
de: "Entscheidet, wie die Zeile, welche die Beschriftung dieses Panels enthält, gezeichnet wird. (str) Folgende Werte sind möglich: Borderless (kein Rahmen, nur eine einfache Füllfarbe; Vorgabe) BorderOnly (einfacher Rahmen, keine Füllfarbe) FilledBorder (Kombination der zwei obigen) VerticalFill (senkrechter Verlauf aus den zwei Beschriftungsfarben) HorizontalFill (waagerechter Verlauf aus den zwei Beschriftungsfarben)

source: #Queries for DB '%s' on host '%s':
de: # Abfragen für DB '%s' auf server '%s':

source: %s couldn't be converted to %s (field %s)
de: %s konnte nicht nach %s konvertiert werden (Feld %s)

source: %s database connection definition(s) loaded.
de: %s Datenbank-Verbindungsdefinition(en) geladen.

source: %s record%sselected in %s second%s
de: %s Datensätze%sausgewählt in %s Sekunden%s

source: %s replacements were made
de: %s Stellen wurden ersetzt.

source: %s: Path does not exist.
de: %s: Pfad existiert nicht.

source: &About
de: &Über...

source: &Actions
de: &Aktionen

source: &Autosize All Columns
de: &Automatische Breite für alle Spalten

source: &Autosize Column
de: &Automatische Spaltenbreite

source: &Browse Records
de: Datensätze %betrachten

source: &Cancel Changes
de: Änderungen stornieren

source: &Copy
de: Kopieren

source: &Delete Current Record
de: Aktuellen &Datensatz löschen

source: &Edit
de: B&earbeiten

source: &File
de: &Datei

source: &Find / Replace
de: &Suchen / Ersetzen

source: &Help
de: &Hilfe

source: &New
de: &Neu ...

source: &New Record
de: &Neuer Datensatz

source: &Normal Zoom
de: &Normaler Zoom

source: &Paste
de: Ein&fügen

source: &Pick
de: &Wählen

source: &Quit
de: &Beenden

source: &Redo
de: &Wiederholen:

source: &Requery
de: Auff&rischen

source: &Save Changes
de: Änderungen &speichern

source: &Undo
de: &Rückgängig:

source: &View
de: &Ansicht

source: '%s' can not be translated into a color
de: '%s' kann nicht in eine Farbe übersetzt werden

source: 'Choices' is not a valid property for a dListControl.
de: 'Choices' ist keine gültige Eigenschaft eines dListControl.

source: 'dCheckListBox' is a deprecated name. Use 'dCheckList' instead
de: 'dCheckListBox' ist ein auslaufender Name. Verwende stattdessen 'dCheckList'

source: 'dFoldPanel' is a deprecated name. Use 'dSlidePanel' instead
de: 'dFoldPanel' ist ein auslaufender Name. Verwende stattdessen 'dSlidePanel'

source: 'dFoldPanelBar' is a deprecated name. Use 'dSlidePanelControl' instead
de: 'dFoldPanelBar' ist ein auslaufender Name. Verwende stattdessen 'dSlidePanelControl'

source: 1 replacement was made
de: 1 Ersetzung wurde ausgeführt

source: < Back
de: < Zurück

source: < New File >
de: < Neue Datei >

source: A dictionary mapping virtual_field_name to a function to call. The specified function will be called when getFieldVal() is called on the specified field name.
de: Ein Dictionary zur Zuordung von virtual_field_name zu einer Funktion. Die angegebene Funktion wird aufgerufen, wenn getFieldVal() für das angegebene Feld aufgerufen wird.

source: A dictionary mapping virtual_field_name to function to call. The specified function will be called when getFieldVal() is called on the specified virtual field name.
de: Ein Dictionary zur Zuordung von virtual_field_name zu einer Funktion. Die angegebene Funktion wird aufgerufen, wenn getFieldVal() für das angegebene Feld aufgerufen wird.

source: A dictionary specifying default values for fields when a new record is added. The values of the dictionary can be literal (must match the field type), or they can be a function object which will be called when the new record is added to the bizobj.
de: Eine Beschreibung der Standardwerte für Felder eines neuen Datensatzes. - Die eigentlichen Werte der Beschreibung (entsprechend Feldtypen) - Funktionsobjekt, das bei einem neuen Datensatz aufgerufen wird

source: A dropdown list that appears right below the search button (list)
de: Eine Auswahlliste, die direkt unter dem Such-Knopf erscheint (list)

source: A property that user code can safely use for specific purposes.
de: Eine Eigenschaft, die User-Code für bestimmte Zwecke benutzen darf.

source: A unique identifier used for referencing by other objects. (str)
de: Ein eindeutiger Bezeichner, der von anderen Objekten zur Referenzierung verwendet wird. (str)

source: About
de: Über...

source: About this application
de: Über diese Anwendung

source: Actions
de: Aktionen

source: Activate
de: Aktivieren

source: Active control isn't text-based.
de: Das aktive Eingabeelement basiert nicht auf einem Textelement.

source: Add a new record
de: Neuen Datensatz hinzufügen

source: Add a new record to the dataset.
de: Neuen Datensatz anlegen

source: Add new record failed with response: %s
de: Neuanlage fehlgeschlagen mit Antwort: %s

source: After a requery, do we try to restore the record position to the same PK?
de: Nach einem Requery versuchen, die Rekordposition zum gleichen PK wiederherzustellen?

source: After running a scan, do we attempt to restore the record position to where it was before the scan (True, default), or do we leave the pointer at the end of the recordset (False). (bool)
de: Falls True wird die Postion im Recordset nach einem Scan auf den ursprünglichen Wert zurück gesetzt, ansonsten bleibt der Zeiger am Ende des Recordset. (Vorgabe:False) (bool)

source: Alias for the MaxDimensions property. (char: 'r' or 'c'(default) )
de: Alias für die Eigenschaft MaxDimensions. Zeichen: 'r' oder 'c' (Vorgabe)

source: Already at the beginning of the data set.
de: Bereits am Anfang des Datenbestands.

source: Already at the end of the data set.
de: Bereits am Ende des Datenbestands.

source: Also note that this page has a different icon!
de: Beachten Sie, dass diese Seite ein anderes Icon hat!

source: Alternate way of setting/getting the Value, using percentage of the Range. (float)
de: Alternative, um den Wert als Prozent-Angabe der Bandbreite auszulesen oder zu setzen. (float)

source: Alternative means of starting/stopping the timer, or determining its status. If Enabled is set to True and the timer has a positive value for its Interval, the timer will be started.
de: Alternative, um den Zeitgeber zu starten/stoppen, oder seinen Status abzufragen. Wenn Enabled auf True gesetzt wird und der Zeitgeber einen positiven Wert für sein Intervall hat, wird der Zeitgeber gestartet.

source: Amount of space automatically inserted between elements. (int)
de: Menge an Leerraum, die automatisch zwischen Elemente eingefügt wird. (int)

source: Amount the control's value changes when the spinner buttons are clicked (int/float)
de: Betrag, um der sich der Wert des Elements ändert, wenn die Kontrollknöpfe gedrückt werden (int/float)

source: An error occured while preparing preview.
de: Bei der Vorbereitung der Druckvorschau ist ein Fehler aufgetreten

source: An error occured while printing.
de: Fehler beim Drucken

source: An invalid XML string was encountered
de: Ein ungültiger XML String wurde gefunden

source: An item already exists in that location
de: An dieser Position gibt es bereit ein Element.

source: Angle (in degrees) to draw text (int)
de: Winkel (in Grad), in dem der Text gezeichnet werden soll (int)

source: Angle (in degrees) used to end drawing a circular or elliptic arc (int)
de: Winkel (in Grad), wo ein kreis- oder ellipsenförmiger Bogen enden soll (int)

source: Angle (in degrees) used to start drawing a circular or elliptic arc (int)
de: Winkel (in Grad), wo ein kreis- oder ellipsenförmiger Bogen anfangen soll (int)

source: Application finished.
de: Anwendung beendet.

source: Approximate number of spaces taken by each tab character (default=4) (int)
de: Näherungsweise Anzahl von Leerzeichen, die jedes Tabulator-Zeichen einnehmen soll (Vorgabe=4) (int)

source: Are borders around cells shown? (bool)
de: Werden Rahmen um die Zellen angezeigt? (bool)

source: Are column labels shown? (bool)
de: Werden Spaltenbeschriftungen angezeigt? (bool)

source: Are row labels shown? (bool)
de: Werden Zeilenbeschriftungen angezeigt? (bool)

source: Are the items in the control automatically sorted? Default=False. If True, whenever the Choices property is changed, the resulting list will be first sorted using the SortFunction property, which defaults to None, giving a default sort order. (bool)
de: Werden die Einträge in diesem Element automatisch sortiert? (Vorgabe=False) Wenn dies auf True gesetzt wird, wird die resultierende Liste jedes Mal sortiert, wenn die Eigenschaft Choices geändert wird. Dazu wird die Eigenschaft SortProperty herangezogen; solange diese auf dem Vorgabewert None steht, wird die Standardreihenfolge mit sort bestimmt. (bool)

source: Are we tracking bookmarks in the editor? Default=False (bool)
de: Verfolgen wir Lesezeichen im Editor? (Vorgabe=False) (bool)

source: Are you getting excited yet??? I know that I am!!
de: Bist du schon aufgeregt? Ich schon!

source: Are you sure you want to exit?
de: Sind Sie sicher, dass Sie beenden wollen?

source: Attempt in object '%s' to set duplicate RegID: '%s'
de: Versuch, im Objekt '%s' eine doppelte RegID '%s' zu setzen.

source: Attempt to set PictureIndex (%(idx)s)to a value greater than the maximum index available (%(maxIdx)s).
de: Versuch, PictureIndex (%(idx)s) auf einen größeren Wert als den möglichen Maximalwert (%(maxIdx)s) zu setzen.

source: Attempt to show non-member page
de: Versuch, eine Seite anzuzeigen, die nicht dazugehört.

source: Attempted to add Dabo to the list!!!
de: Versuch, Dabo zur Liste hinzuzufügen!

source: Automatically loading default ui '%s'...
de: Lade automatisch die Standard-Benutzeroberfläche '%s'...

source: Autosize all columns in the grid.
de: Die Breite aller Spalten in dieser Tabelle wird automatisch bestimmt.

source: Autosize the column based on the data in the column.
de: Die Größe der Spalte wird abhängig von ihrem Inhalt automatisch berechnet.

source: Auxiliary cursor object that handles queries that would otherwise affect the main cursor's data set. (dCursorMixin subclass)
de: Zusätzliches Cursor-Objekt zur Abarbeitung von Abfragen, die sonst den Datenbestand des Hauptcursors beeinflussen würden. (abgeleitet von dCursorMixin)

source: Available Keys: ============= T : Today + : Up One Day - : Down One Day [ : Up One Month ] : Down One Month M : First Day of Month H : Last Day of montH Y : First Day of Year R : Last Day of yeaR C: Popup Calendar to Select
de: Mögliche Tasten: ============= T : Heute (Today) + : einen Tag weiter - : einen Tag zurück [ : einen Monat weiter ] : einen Monat zurück M : erster Tag des Monats H : letzter Tag des Monats (montH) Y : erster Tag des Jahres (Year) R : letzter Tag des Jahres (yeaR) C: Kalender zum Auswählen

source: BAD TYPE: %s
de: FALSCHER TYP: %s

source: BackColor of selected cells (str or RGB tuple)
de: BackColor (Hintergrundfarbe) der ausgewählten Zellen (str oder RGB-tuple)

source: Backend encoding (str)
de: Backend-Kodierung (str)

source: Background color for the shape (color)
de: Hintergrundfarbe für die Form (color)

source: Background color of selected text. Default=yellow (str or tuple)
de: Hintergrundfarbe des ausgewähltes Textes. (Vorgabe=yellow) (str oder tuple)

source: Background color of text when using text objects (str or tuple)
de: Hintergrundfarbe für Text, wenn Text-Objekte verwendet werden (str oder tuple)

source: Background color of the calendar header (str or tuple)
de: Hintergrundfarbe des Kalender-Kopfes (str oder tuple)

source: Background color of the calendar highlight (str or tuple)
de: Hintergrundfarbe der Hervorhebung im Kalender (str oder tuple)

source: Background color of the calendar holiday (str or tuple)
de: Hintergrundfarbe der Feiertage im Kalender (str oder tuple)

source: Background color of this node (str, 3-tuple, or wx.Colour)
de: Hintergrundfarbe dieses Knotens (str, 3-tuple oder wx.Colour)

source: Base key used when saving/restoring preferences (str)
de: Basisschlüssel zum Speichern/Wiederherstellen von Einstellungen (str)

source: Base key used when saving/restoring preferences. This differs from the default definition of this property in that if it is empty, it will return the ActiveForm's BasePrefKey or the MainForm's BasePrefKey in that order. (str)
de: Basisschlüssel zum Speichern von Einstellungen. Unterscheidet sich von der Standard-Definition dieser Eigenschaft insofern, dass er den BasePrefKey des aktiven Formulars (ActiveForm) oder des Hauptformulars (MainForm) zurückgibt (in dieser Reihenfolge). (str)

source: Bitmap to be drawn on the object (dBitmap)
de: Bitmap, das auf das Objekt gezeichnet werden soll (dBitmap)

source: Bold setting for text objects (bool)
de: Fett-Einstellung für Text-Objekte (bool)

source: Bold setting for this font (bool)
de: Fett-Einstellung für diese Schriftart (bool)

source: Border between the contents and edges of the panel. Default=5 (int)
de: Rahmen zwischen den Inhalten und Rändern des Panels (Vorgabe=5) (int)

source: Bottom coordinate of the panel when floating (int)
de: Untere Koordinate des Panels, wenn nicht angedockt (int)

source: Bottom/Right color for the gradient (color: str or tuple)
de: Verlaufsfarbe der rechten unteren Ecke (Farbe: str oder tuple)

source: Browse
de: Blättern

source: Browse the records in the current recordset.
de: Datensätze im aktuellen Datenbestand durchsuchen

source: Business Rule Violation: %s.
de: Verletzung der Geschäftsregel: %s.

source: By default, do we add the border to all sides? (bool)
de: Ergänzen wir als Vorgabe den Rahmen auf allen Seiten? (bool)

source: By default, do we add the border to the bottom side? (bool)
de: Ergänzen wir als Vorgabe den Rahmen unten? (bool)

source: By default, do we add the border to the left side? (bool)
de: Ergänzen wir als Vorgabe den Rahmen links? (bool)

source: By default, do we add the border to the right side? (bool)
de: Ergänzen wir als Vorgabe den Rahmen rechts? (bool)

source: By default, do we add the border to the top side? (bool)
de: Ergänzen wir als Vorgabe den Rahmen oben? (bool)

source: Can be one of either 'Sunday' or 'Monday'. Determines which day of the week appears in the first column. Defaults to the value set in dabo.settings.firstDayOfWeek. Read-only at runtime. (str)
de: Kann entweder 'Sunday' oder 'Monday' sein. Bestimmt, welcher Wochentag in der ersten Spalte erscheint. Vorgabe ist der Wert von dabo.settings.firstDayOfWeek. Kann zur Laufzeit nur gelesen werden. (str)

source: Can multiple items be selected at once? (bool)
de: Können mehrere Einträge auf einmal ausgewählt werden?

source: Can the panel be docked to the bottom edge of the form? Default=True (bool)
de: Kann das Panel an der Unterseite des Formulars angedockt werden? Standard=True (bool)

source: Can the panel be docked to the form? Default=True (bool)
de: Kann das Panel am Formular angedockt werden? Standard=True (bool)

source: Can the panel be docked to the left edge of the form? Default=True (bool)
de: Kann das Panel an der linken Seite des Formulars angedockt werden? Standard=True (bool)

source: Can the panel be docked to the right edge of the form? Default=True (bool)
de: Kann das Panel an der rechten Kante des Formulars angedockt werden? Standard=True (bool)

source: Can the panel be docked to the top edge of the form? Default=True (bool)
de: Kann das Panel an der Oberseite des Formulars angedockt werden? Standard=True (bool)

source: Can the panel be moved (True, default), or is it in a fixed position (False). (bool)
de: Kann das Panel bewegt werden (True, Standard), oder ist seine Position festgelegt (False). (bool)

source: Can the panel be resized? Default=True (bool)
de: Kann das Panel in der Größe verändert werden?

source: Can the panel be undocked from the form and float independently? Default=True (bool)
de: Kann das Panel vom Formular abgedockt werden und unabhängig schweben? Standard=True (bool)

source: Can the user choose the 'expanded' quick report?
de: Darf der Benutzer den "erweiterten" Kurzbericht auswählen ?

source: Can the user sort fields in the select page?
de: Darf der Benutzer die Felder auf der Auswahlseite sortieren?

source: Can't convert to decimal.
de: Konvertierung nach dezimal nicht möglich.

source: Can't convert.
de: Konvertierung nicht möglich.

source: Can't import mx.DateTime
de: Kann mx.DateTime nicht importieren.

source: Can't set ActiveForm: no uiApp.
de: Setzen von ActiveForm nicht möglich: keine uiApp.

source: Can't set default value for nonexistent field '%s'.
de: Vorgabewert für das nicht existierende Feld '%s' kann nicht gesetzt werden.

source: Cancel
de: Abbrechen

source: Cancel Not Allowed
de: Abbrechen nicht zulässig

source: Cancel any changes made to the records.
de: Alle Datensatzänderungen verwerfen.

source: Cancel changes
de: Änderungen verwerfen

source: Cancel failed with response: %s
de: Abbruch fehlgeschlagen mit Antwort: %s

source: Cancel failed; no records to cancel.
de: Abbruch fehlgeschlagen, keine Datensätze zu verwerfen.

source: CancelButton isn't implemented yet.
de: CancelButton ist noch nicht implementiert

source: Cannot access the Dabo site. Error: %s
de: Kann die Dabo-Site nicht erreichen. Fehler: %s

source: Cannot change the uiType to '%s', because UI '%s' is already loaded.
de: Kann den uiType nicht auf '%s' ändern, weil die Benutzeroberfläche '%s' bereits geladen ist.

source: Cannot create custom editor without a control class specified.
de: Kann keinen individuellen Editor anlegen, wenn keine Klasse für das Element definiert ist.

source: Cannot populate without data for alias '%s'
de: Ohne Daten für '%s' kann ich den Datensatz nicht ausfüllen

source: Cannot reverse in the middle of iteration.
de: Umkehrung während des Iterierens nicht möglich.

source: Cannot set InputCodes when a Format has been set
de: InputCodes kann nicht gesetzt werden, wenn ein Format gesetzt wurde.

source: Cannot set PageCount to less than zero.
de: Seitenzahl (PageCount) darf nicht negativ sein.

source: Cannot set PanelCount to less than zero.
de: Anzahl der Panels (PanelCount) darf nicht negativ sein.

source: Cannot set a Mask when a Format has been set
de: Kann keine Maske setzen, wenn ein Format gesetzt ist.

source: Cannot set the Borderless property once the dialog is created.
de: Kann die Eigenschaft Borderless nicht mehr setzen, sobald der Dialog erzeugt wurde.

source: Cannot set the Size of a docked panel
de: Kann die Größe des gedockten Panels nicht setzen

source: Cannot set the position of a docked panel
de: Kann die Position des gedockten Panels nicht setzen

source: Cannot set width of column %s
de: Breite der Spalte %s kann nicht geändert werden.

source: Cannot update files; Error: %s
de: Kann Dateien nicht aktualisieren, Fehler: %s

source: Caption displayed on the panel bar (str)
de: Beschriftung in der Panel-Zeile (str)

source: Caption for the box (str)
de: Titelzeile der Box (str)

source: Caption for the sorting list (str)
de: Titel der sortierten Liste (str)

source: Case must be either upper, lower, capitalize, or invert.
de: 'Case' muss 'upper' (Großbuchstaben), 'lower' (Kleinbuchstaben), 'capitalize' (erster Buchstabe groß) oder 'invert' (umgekehrt) sein.

source: Centers the form on the screen when set to True. (bool)
de: Zentriert das Formular auf dem Bildschirm, wenn True. (bool)

source: Changes to %s canceled.
de: Änderungen in %s verworfen.

source: Changes to %s saved.
de: Änderungen in %s gesichert
